{
    "asl": [
        {
            "name": "ASL",
            "description": "Active learning is a pedagogical approach where students transition from passive recipients to active contributors in the course of their studies. The focus is providing and getting immediate feedback and interactive participation. The aim of this introductory overview is to provide a better understanding of the diverse nature of active student learning, emphasising its role in improving critical thinking, collaboration and sustained enthusiasm for lifelong learning within the formal education system. There are different methods of active student leaning that can be useful for various types of student and teachers such as gamification, game-based learning, experiential learning, flipped classrooms, discussions, ProLab, makerspaces and physical active learning (PAL).",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "P.",
                                "lastName": "Hendrickson"
                            }
                        ],
                        "year": 2019,
                        "title": "Effect of active learning techniques on student excitement, interest, and Self-Efficacy",
                        "journal": "Journal of Political Science Education",
                        "volume": "17",
                        "issue": "2",
                        "pages": "311–325",
                        "doi": "10.1080/15512169.2019.1629946",
                        "url": "https://doi.org/10.1080/15512169.2019.1629946",
                    },
                    "keywords": [
                        "Simulations",
                        "debates",
                        "counterfactual analysis"
                    ],
                    "summary": "In a course on American foreign policy and national security, active teaching methods such as simulations, debates, and counterfactual analysis have driven students' excitement, interest, and confidence. The most significant effect has been the simulation; stimulating excitement, interest and belief in oneself. These activities have helped students to define their educational objectives related to national security and policy making. The active learning activities provided new and different opportunities for students to involve themselves in the learning process, engaging them in new ways and activating different academic and intellectual skills."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J. A.",
                                "lastName": "Michael"
                            }
                        ],
                        "year": 2006,
                        "title": "Where’s the evidence that active learning works?",
                        "journal": "Advances in Physiology Education",
                        "volume": "30",
                        "issue": "4",
                        "pages": "159–167",
                        "doi": "10.1152/advan.00053.2006",
                        "url": "https://doi.org/10.1152/advan.00053.2006",
                    },
                    "keywords": [
                        "Active learning",
                        "students collaboration"
                    ],
                    "summary": "Traditional education focuses on passive learning, highlighting the necessity for active learning programs where students acquire knowledge rather than simply believing it. Educational reforms should rely on robust research evidence, favoring active learning and student-centered teaching methods, recognizing the difference between declarative ('knowing that') and procedural ('knowing how') knowledge is crucial. With a solid background of evidence in support of mutual learning methods, learning together with others has been shown to be much more efficient that working alone. Evidence shows the effectiveness of active learning as well as student-centered teaching, particularly in physiology."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Freeman"
                            },
                            {
                                "firstName": "S. L.",
                                "lastName": "Eddy"
                            },
                            {
                                "firstName": "M. J.",
                                "lastName": "McDonough"
                            },
                            {
                                "firstName": "M. K.",
                                "lastName": "Smith"
                            },
                            {
                                "firstName": "N.",
                                "lastName": "Okoroafor"
                            },
                            {
                                "firstName": "H.",
                                "lastName": "Jordt"
                            },
                            {
                                "firstName": "M. P.",
                                "lastName": "Wenderoth"
                            }
                        ],
                        "year": 2014,
                        "title": "Active learning increases student performance in science, engineering, and mathematics",
                        "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                        "volume": "111",
                        "issue": "23",
                        "pages": "8410–8415",
                        "doi": "10.1073/pnas.1319030111",
                        "url": "https://doi.org/10.1073/pnas.1319030111",
                    },
                    "keywords": [
                        "Active learning",
                        "traditional learning"
                    ],
                    "summary": "Active learning has shown significant benefits in the meta-analysis of 225 studies on STEM education. Compared to traditional lecture based classes, students in active learning environments were more successful. On average, exam scores increased by approximately 6% in active learning settings, and active learning reduced the likelihood of students failing by 1.5 times compared to traditional lectures. In addition, active learning has proven to be effective in any class size and its greatest benefits have been seen in smaller classes."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "A.",
                                "lastName": "Mitchell"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Petter"
                            },
                            {
                                "firstName": "A. L.",
                                "lastName": "Harris"
                            }
                        ],
                        "year": 2017,
                        "title": "Learning By Doing: Twenty Successful Active learning Exercises for Information Systems courses",
                        "journal": "Journal of Information Technology Education : Innovations in Practice",
                        "volume": "16",
                        "pages": "021–046",
                        "doi": "10.28945/3643",
                        "url": "https://doi.org/10.28945/3643",
                    },
                    "keywords": [
                        "Active learning"
                    ],
                    "summary": "The paper reviews active learning methods in Information Systems (IS) training, which highlight their effectiveness to engage students. It provides guidance for faculty in the field of IT on how to enhance learning outcomes, identifying and evaluating exercises that involve students during or after school hours. The paper sets out 20 types of exercises, such as visual presentation, collaboration projects, technological interaction, evaluations, and games."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "P.",
                                "lastName": "Armbruster"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Patel"
                            },
                            {
                                "firstName": "E.",
                                "lastName": "Johnson"
                            },
                            {
                                "firstName": "M. R.",
                                "lastName": "Weiss"
                            }
                        ],
                        "year": 2009,
                        "title": "Active learning and student-centered pedagogy improve student attitudes and performance in introductory biology",
                        "journal": "CBE- Life Sciences Education",
                        "volume": "8",
                        "issue": "3",
                        "pages": "203–213",
                        "doi": "10.1187/cbe.09-03-0025",
                        "url": "https://doi.org/10.1187/cbe.09-03-0025",
                    },
                    "keywords": [
                        "Student engagement",
                        "academic performance",
                        "student-centered",
                        "feedback",
                        "pedagogy"
                    ],
                    "summary": "Traditional lectures have been redesigned to focus on active learning, resulting better student engagement, satisfaction, and efficiency. Part of the evaluation included surveys, comparison of final exams, and assessment of student attitudes and performance. A variety of student-focused methods, such as click questions and quizzes, have been shown to be effective in demonstrating higher learning outcomes. Positive feedback from students is increasing every year, but the difficulties associated with restructuring the course are being addressed and discussed."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "B. A.",
                                "lastName": "Şeşen"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "Tarhan"
                            }
                        ],
                        "year": 2011,
                        "title": "Active-learning versus teacher-centered instruction for learning acids and bases",
                        "journal": "Research in Science & Technological Education",
                        "volume": "29",
                        "issue": "2",
                        "pages": "205–226",
                        "doi": "10.1080/02635143.2011.581630",
                        "url": "https://doi.org/10.1080/02635143.2011.581630",
                    },
                    "keywords": [
                        "Active-learning",
                        "constructivism",
                        "learning achievement",
                        "misconceptions"
                    ],
                    "summary": "The article compares active learning with teacher-oriented instruction for knowledge of acids and bases. To identify misconceptions, it includes pre-test and post-test scores as well as interviews with students. In terms of improving learning outcomes and preventing misconceptions, the study found that the active learning approach was more effective than the teacher-centered approach."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "F. M.",
                                "lastName": "Rezende-Filho"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "Fonseca"
                            },
                            {
                                "firstName": "V.",
                                "lastName": "Nunes-Souza"
                            },
                            {
                                "firstName": "G.",
                                "lastName": "Da Silva Guedes"
                            },
                            {
                                "firstName": "L. A.",
                                "lastName": "Rabelo"
                            }
                        ],
                        "year": 2014,
                        "title": "A student-centered approach for developing active learning: the construction of physical models as a teaching tool in medical physiology",
                        "journal": "BMC Medical Education",
                        "volume": "14",
                        "issue": "1",
                        "doi": "10.1186/1472-6920-14-189",
                        "url": "https://doi.org/10.1186/1472-6920-14-189",
                    },
                    "keywords": [
                        "Active learning",
                        "meaningful learning",
                        "teaching-learning methodologies"
                    ],
                    "summary": "The article describes a student-centered teaching-learning methodology in physiology, focusing on the construction of physiological-physical models. To study various physiology topics, students worked in small groups to create models using low-cost materials. The study has shown that the proposed method facilitates active and meaningful learning, addresses different learning styles, and encourages the development of skills relevant to health professionals. Overall, the approach has been considered to be an attractive, accessible, and relatively simple way of enhancing physiology training."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "F.",
                                "lastName": "Putri"
                            }
                        ],
                        "year": 2014,
                        "title": "Student-Centered Learning Addressing Faculty Questions about Student-centered Learning",
                        "journal": "Unja",
                        "url": "https://www.academia.edu/6577937/Student_Centered_Learning_Addressing_Faculty_Questions_about_Student_centered_Learning",
                    },
                    "keywords": [
                        "Team-based learning",
                        "student-centered learning",
                        "active learning"
                    ],
                    "summary": "The article looks at the implementation of a student-focused learning approach in large classes. It addresses faculty concerns and offers strategies for using informal small-group work. In addition, it provides insight into team-based learning and strategies to get teams off to a good start. The importance of moving slowly and thoughtfully towards a student-centered learning approach is highlighted in the article. The benefits of students taking responsibility for their own learning and the difficulties associated with using student teams are also highlighted in this report. The article provides important information and strategies on the implementation of student-centered learning in larger schools."
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Goodchild"
                            },
                            {
                                "firstName": "K.",
                                "lastName": "Bjørkestøl"
                            },
                            {
                                "firstName": "I. C.",
                                "lastName": "Borge"
                            },
                            {
                                "firstName": "H. K.",
                                "lastName": "Nilsen"
                            },
                            {
                                "firstName": "O. H. M.",
                                "lastName": "Tonheim"
                            }
                        ],
                        "year": 2021,
                        "title": "Educating to inspire active learning approaches in mathematics in Norwegian universities",
                        "journal": "Nordic Journal of STEM Education",
                        "volume": "5",
                        "issue": "1",
                        "doi": "10.5324/njsteme.v5i1.3972",
                        "url": "https://doi.org/10.5324/njsteme.v5i1.3972",
                    },
                    "keywords": [
                        "Teaching approaches",
                        "Norwegian Higher Education Institutions (HEIs)",
                        "active learning",
                        "small groups"
                    ],
                    "summary": "The article discusses a national survey on teaching methods for mathematics courses in higher education institutions. The objective of the survey was to find out more about how teachers are using educational approaches that stimulate active learning in math. The analysis showed that working in small groups has a higher potential to promote active learning, using both qualitative and quantitative methods."
                }
            ]
        },
        {
            "name": "Discussion",
            "description": "Discussion based learning is an interactive approach to education that focuses on active student participation through group discussions and debates. This method requires students to express their views, share perspectives and take part in critical thinking instead of following lectures alone. The students learn how to listen, express their opinions and think about the diversity of views, thereby creating an active and constructive learning environment which is more than just lecture based methods.",
            "sub-category": "Discussion",
            "sources": [
                {
                    "citation": {
                        "type": "conference",
                        "authors": [
                            {
                                "firtstName": "S.",
                                "lastName": "Wu"
                            },
                            {
                                "firtstName": "H.",
                                "lastName": "Hou"
                            },
                            {
                                "firtstName": "S. Y.",
                                "lastName": "Chen"
                            },
                            {
                                "firtstName": "E. Z. F.",
                                "lastName": "Liu"
                            },
                            {
                                "firtstName": "W.",
                                "lastName": "Hwang"
                            }
                        ],
                        "year": 2012,
                        "title": "Discussion Models in Seamless Online Learning Integrated Discussion (SOLID) Environment: Selection vs. Performance",
                        "doi": "https://doi.org/10.1109/icalt.2012.31",
                        "conference": "IEEE 12th International Conference on Advanced Learning Technologies",
                        "location": "Rome, Italy"
                    },
                    "keywords": [
                        "Educational institutions",
                        "computational modeling",
                        "solid modeling",
                        "problem-solving"
                    ],
                    "summary": " In the study, 41 college students in the field of child and infant care participated in problem solving and project discussions using SOLID. They preferred asynchronous discussions (M2) over synchronous (M1) or mixed (M3) formats for problem-solving activities. For project-based activities, all groups used asynchronous (M2) or mixed discussions (M3).  Quality-wise, mixed discussions (M3) performed better than asynchronous ones (M2), suggesting that combining synchronous and asynchronous elements improved discussion outcomes.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "book",
                        "authors": [
                            {
                                "firtstName": "F.",
                                "lastName": "Han"
                            },
                            {
                                "firtstName": "R. A.",
                                "lastName": "Ellis"
                            }
                        ],
                        "year": 2019,
                        "title": "Identifying consistent patterns of quality learning discussions in blended learning",
                        "journal": "The Internet and Higher Education",
                        "volume": "40",
                        "pages": "12-10",
                        "doi": "https://doi.org/10.1016/j.iheduc.2018.09.002",
                    },
                    "keywords": [
                        "Academic achievement",
                        "face-to-face discussions",
                        "online discussions"
                    ],
                    "summary": "The study analysed the influence ofblended discussions on education among postgraduates, finding differences in educational quality. Deep discussion approaches and higher academic performance correlated positively with coherent learning concepts in discussions. The course evaluations have been closely interconnected with the internet discussions, which offer specific advantages.  The results showed a positive correlation between cohesive concepts and deep approaches, while fragmented concepts and surface approaches showed a negative correlation in both face to face and online discussions.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "type": "book",
                        "authors": [
                            {
                                "firtstName": "J.",
                                "lastName": "Rothgeb"
                            }
                        ],
                        "year": 2018,
                        "title": "Do online discussion groups enhance students’ analytical ability and recall of factual knowledge?",
                        "journal": "Journal of Political Science Education",
                        "volume": "14",
                        "issue": "3",
                        "pages": "331-340",
                        "doi": "https://doi.org/10.1080/15512169.2017.1402684",
                    },
                    "keywords": [
                        "Discussion groups",
                        "interactive learning",
                        "online learning"
                    ],
                    "summary": "For two parts of the World Politics course, using internet discussion groups and without ODGs, the study compares 2 sections to see if they have any difference. While participation in ODG correlated to higher overall GPA, there were no significant differences of factual recall or analytical performance between ODG and non ODG sections. These results could have been affected by factors such as group size and measurement techniques.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "L.",
                                "lastName": "Williams"
                            },
                            {
                                "firstName": "M. P.",
                                "lastName": "Lahman"
                            }
                        ],
                        "year": 2011,
                        "title": "Online discussion, student engagement, and critical thinking",
                        "journal": "Journal of Political Science Education",
                        "volume": "7",
                        "issue": "2",
                        "pages": "143–162",
                        "doi": "10.1080/15512169.2011.564919",
                        "url": "https://doi.org/10.1080/15512169.2011.564919"
                    },
                    "keywords": [
                        "Computer-mediated communication",
                        "critical thinking",
                        "online discussion",
                        "student engagement"
                    ],
                    "summary": "Students used ANGEL software for the online discussion in traditional undergraduate courses. Divided into three groups per course, some discussions were moderated, while others were not. The level of participation and substantial replies was encouraged, with the awarding of points. The study examined 361 posts, looking at the interaction and critical thinking dimensions. The findings show that, although student characteristics such as course levels, GPAs and gender have no correlation with critical thinking, there has been an increased interaction in discussions associated with larger level of critical thinking.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "book",
                        "authors": [
                            {
                                "firtstName": "E. M.",
                                "lastName": "Asem"
                            },
                            {
                                "firtstName": "B.",
                                "lastName": "Rajwa"
                            }
                        ],
                        "year": 2023,
                        "title": "Impact of combination of short lecture and group discussion on the learning of physiology by nonmajor undergraduates",
                        "journal": "Advances in Physiology Education",
                        "volume": "47",
                        "issue": "1",
                        "pages": "1-12",
                        "doi": "https://doi.org/10.1152/advan.00022.2022",
                    },
                    "keywords": [
                        "Active learning",
                        "blended learning",
                        "student-centered learning",
                        "teaching method"
                    ],
                    "summary": "The impact of group discussions on a nongradual college student learning mammalian physiology was assessed in the study. Participation of students and an improved understanding of physiology in all grade levels have been enhanced through the integration of traditional lectures with group discussions. These findings support the development of studentcentered learning, highlight the effectiveness of combining lectures and group discussion for students who do not major in physiology.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Blings"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Maxey"
                            }
                        ],
                        "year": 2016,
                        "title": "Teaching Students to Engage with Evidence: An Evaluation of Structured Writing and Classroom Discussion Strategies",
                        "journal": "Journal of Political Science Education",
                        "doi": "10.1080/15512169.2016.1168303",
                        "url": "https://doi.org/10.1080/15512169.2016.1168303",
                    },
                    "keywords": [
                        "Active learning",
                        "critical thinking"
                    ],
                    "summary": "The study compared group discussions and structured-writing exercises in first-year writing seminars using a political science article. Group discussions have proven to be more effective and have enhanced the summarization and evaluation of students' evidence. Both methods have reinforced the importance of active learning, in particular group discussions, when it comes to smaller classroom settings, with regard to both understanding and evaluating critically.",
                    "studentActivityScore": 8,
                    "lecturerActivityScore": 4
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S. A.",
                                "lastName": "Stearns"
                            }
                        ],
                        "year": 2017,
                        "title": "Student Responsible Learning: Getting students to read online discussions",
                        "journal": "College Teaching",
                        "volume": "65",
                        "issue": "2",
                        "pages": "69–78",
                        "doi": ""
                    },
                    "keywords": [
                        "Course design",
                        "hybrid learning",
                        "online discussions"
                    ],
                    "summary": "To promote critical thinking, A Thematic Analysis Assignment (TAA) was introduced to two senior level courses with the focus on Ervin Goffman's 'Stigma.' Survey responses from students showed strong engagement, with 86.7% acknowledging the assignment's benefits for learning. It made it easier for colleagues to interact and create a positive learning environment. The deadline was a problem for some students. Overall, the TAA has effectively promoted active learning and peer interaction while suggesting only minor modifications for future use.",
                    "studentActivityScore": 8,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "K.",
                                "lastName": "Abdulbaki"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Suhaimi"
                            },
                            {
                                "firstName": "A.",
                                "lastName": "AlSaqqaf"
                            },
                            {
                                "firstName": "W.",
                                "lastName": "Jawad"
                            }
                        ],
                        "year": 2018,
                        "title": "The use of the discussion method at University: Enhancement of Teaching and learning",
                        "journal": "International Journal of Higher Education",
                        "volume": "7",
                        "issue": "6",
                        "pages": "118",
                        "doi": "10.5430/ijhe.v7n6p118",
                        "url": "https://doi.org/10.5430/ijhe.v7n6p118",
                    },
                    "keywords": [
                        "Cognitive abilities",
                        "student perception",
                        "language skills"
                    ],
                    "summary": "In large classes at university, discussion is an effective method of teaching which requires highly qualified teachers to be in charge. The students, who were surveyed using the Likert scale, preferred to debate rather than lecture. This approach strengthens language skills, cognition and individual development to promote an educational environment conducive to learning. Discussions can give students an opportunity to express themselves, defend and shape their opinion, which benefits both academics and society in general.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 2
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Lim"
                            },
                            {
                                "firstName": "H.",
                                "lastName": "Ko"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Park"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Ihm"
                            }
                        ],
                        "year": 2022,
                        "title": "Effect of active learning and online discussions on the academic performances of dental students",
                        "journal": "BMC Medical Education",
                        "volume": "22",
                        "issue": "1",
                        "doi": "10.1186/s12909-022-03377-9",
                        "url": "https://doi.org/10.1186/s12909-022-03377-9",
                    },
                    "keywords": [
                        "Discussion",
                        "active learning",
                        "online learning",
                        "self-study"
                    ],
                    "summary": "The study focused on dental students studying law, assessing the effect of discussions in online and offline health professions courses. A total of 114 participants were tested for the Criminal Procedure Code in four online and two offline groups. In particular, the online Self Study and Discussion Group performed very well in spite of an even better score for the offline equivalent. There were no significant differences between online and offline verbatim groups when it came to item scores. However, the offline seminar and discussion group scored higher in transfer item scores. In summary, this study supports the effectiveness of self-studies and discussion in online courses for students who are studying to be dentists.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 4
                },
                {
                    "citation": {
                        "type": "conference",
                        "authors": [
                            {
                                "firstName": "N.",
                                "lastName": "Mosina"
                            }
                        ],
                        "year": 2014,
                        "title": "Using wiki-based discussion forums in calculus: E-pathway toward improving students’ retention and learning in STEM gateway courses (Minority serving two-year college settings)",
                        "conference": "IEEE Integrated STEM Education Conference",
                        "location": "Princeton, NJ, USA",
                        "doi": "10.1109/isecon.2014.6891038",
                        "url": "https://doi.org/10.1109/isecon.2014.6891038",
                    },
                    "keywords": [
                        "STEM",
                        "e-learning"
                    ],
                    "summary": "The study used mixed methods to analyse the impact of Piazza, a virtual discussion platform, based on data from two semesters. Over time, students' participation increased and fostered a collaborative learning environment in which students actively supported each other. The report found that students' attitudes towards learning were affected positively by retention, achievement in a course of study and their attitude to education. In addition, students felt that the Platform's usefulness as well as its capacity to promote a sense of connection were positive.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "P. H.",
                                "lastName": "Pollock"
                            },
                            {
                                "firstName": "K.",
                                "lastName": "Hamann"
                            },
                            {
                                "firstName": "B. M.",
                                "lastName": "Wilson"
                            }
                        ],
                        "year": 2011,
                        "title": "Learning through discussions: Comparing the benefits of Small-Group and Large-Class settings",
                        "journal": "Journal of Political Science Education",
                        "volume": "7",
                        "issue": "1",
                        "pages": "48–64"
                    },
                    "keywords": [
                        "Critical thinking",
                        "large classes",
                        "small groups"
                    ],
                    "summary": "The study compared discussions in an upper level course of political theory to complete class and small group discussion. Both formats had a positive impact on student engagement and satisfaction, according to feedback from 146 questionnaires. Critical thinking and inclusiveness, which benefits from a diverse range of student backgrounds as well as achievements, have in particular benefited from the smaller groups discussions. The integration of discussions, i.e. small group meetings, can provide a significant enhancement in educational outcomes and overall level of student satisfaction for lecture classes.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "B. M.",
                                "lastName": "Wilson"
                            },
                            {
                                "firstName": "P. H.",
                                "lastName": "Pollock"
                            },
                            {
                                "firstName": "K.",
                                "lastName": "Hamann"
                            }
                        ],
                        "year": 2007,
                        "title": "Does Active Learning Enhance Learner Outcomes? Evidence from Discussion Participation in Online Classes",
                        "journal": "Journal of Political Science Education",
                        "volume": "3",
                        "issue": "2",
                        "pages": "131–142",
                        "doi": "10.1080/15512160701338304",
                        "url": "https://doi.org/10.1080/15512160701338304",
                    },
                    "keywords": [
                        "Active learning",
                        "learner outcomes",
                        "online discussion"
                    ],
                    "summary": "In a Latin American Politics course, 42 students engaged in module-based discussions. The study took into account the level of participation and classified them according to their engagement, thereby creating an active learning index. The findings showed that active learning in the field of discussions was associated with higher GPAs. In addition, women tended to engage in a more active manner compared with men. Lower GPA students' course performance has been significantly enhanced by the reading of peer posts, although this effect is diminishing as grade points are increased. In general, there was a correlation between improved grades and more active participation.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "type": "conference",
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Kode"
                            },
                            {
                                "firstName": "L. A.",
                                "lastName": "Gollapudi"
                            },
                            {
                                "firstName": "R. R.",
                                "lastName": "Tammanagari"
                            },
                            {
                                "firstName": "V.",
                                "lastName": "Pullakavi"
                            }
                        ],
                        "year": 2014,
                        "title": "Using Discussion Forums to Improve Student Retention Rate: Our Experience with Certificate in Information Technology (CIT) Program",
                        "conference": "IEEE 14th International Conference on Advanced Learning Technologies",
                        "location": "Athens, Greece",
                        "doi": "10.1109/icalt.2014.191",
                        "url": "https://doi.org/10.1109/icalt.2014.191",
                    },
                    "keywords": [
                        "Asynchronous discussions",
                        "online teaching"
                    ],
                    "summary": "In order to encourage students' interaction and support, EnhanceEdu interventions in rural technical colleges also included debate forums and a newsletter. In spite of low initial participation, strategies such as sample questions increased engagement, increased the number of assignments submitted, and increased the retention rate, by 97%. Active involvement in forums, highlighting their positive effects on student performance and building a supportive college community has been significantly correlated to higher final grades of 85%.",
                    "studentActivityScore": 10,
                    "lecturerActivityScore": 4
                }
            ]
        },
        {
            "name": "Discussion",
            "description": "Discussion based learning is an interactive approach to education that focuses on active student participation through group discussions and debates. This method requires students to express their views, share perspectives and take part in critical thinking instead of following lectures alone. The students learn how to listen, express their opinions and think about the diversity of views, thereby creating an active and constructive learning environment which is more than just lecture based methods.",
            "sub-category": "Debate",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "A. L.",
                                "lastName": "Oros"
                            }
                        ],
                        "year": 2007,
                        "title": "Let’s debate: Active learning encourages student participation and critical thinking",
                        "journal": "Journal of Political Science Education",
                        "volume": "3",
                        "issue": "3",
                        "pages": "293–311",
                        "doi": "10.1080/15512160701558273",
                        "url": "https://doi.org/10.1080/15512160701558273",
                    },
                    "keywords": [
                        "Active learning",
                        "class participation",
                        "critical thinking",
                        "debate"
                    ],
                    "summary": "This article highlights the incorporation of structured debates as a fundamental part of a politics course. The approach focuses on critical thinking through early debates and teaching of related skills over time. In order to improve critical thinking further, cooperative tools and simulations are used. Pointed questions, involving more students, are added to the discussion after the debate. The format of the debate is very popular within students, which encourages more substantive discussion, increasing participation, improving critical thinking and writing skills.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Mumtaz"
                            },
                            {
                                "firstName": "",
                                "lastName": "Latif"
                            }
                        ],
                        "year": 2017,
                        "title": "Learning through debate during problem-based learning: an active learning strategy",
                        "journal": "Advances in Physiology Education",
                        "volume": "41",
                        "issue": "3",
                        "pages": "390–394",
                        "doi": "10.1152/advan.00157.2016",
                        "url": "https://doi.org/10.1152/advan.00157.2016",
                    },
                    "keywords": [
                        "Debate",
                        "communication skills",
                        "analysis",
                        "decision-making",
                        "critical thinking"
                    ],
                    "summary": "Second year female medical students participated in debates in which they were divided into proposition and opposition groups during 2014-2016. The outcomes showed significant benefits: the debate has helped to strengthen fundamental thinking, an exposure to controversial issues, skills in making arguments, interpretation and analysis of evidence. Furthermore, the meetings had a beneficial impact on communication, negotiation capacity, time management and confidence in expression of ideas.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "A.",
                                "lastName": "Hamouda"
                            },
                            {
                                "firstName": "",
                                "lastName": "Tarlochan"
                            }
                        ],
                        "year": 2015,
                        "title": "Engaging Engineering Students in Active Learning and Critical Thinking through Class Debates",
                        "journal": "Procedia - Social and Behavioral Sciences",
                        "volume": "191",
                        "pages": "990–995",
                        "doi": "10.1016/j.sbspro.2015.04.379",
                        "url": "https://doi.org/10.1016/j.sbspro.2015.04.379",
                    },
                    "keywords": [
                        "Active learning",
                        "debate"
                    ],
                    "summary": "Students from the engineering school with strong mathematics and physics skills are exposed to a wide range of text heavy courses requiring innovative teaching methods. Active learning, including debates, has been implemented in the study and is leading to higher grades. The learning targets of the course have been successfully achieved by most students. The use of debates has had a positive impact on attracting students to study in the engineering field, increasing critical thinking and enhancing academic results.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "D. M.",
                                "lastName": "Woods"
                            }
                        ],
                        "year": 2020,
                        "title": "Teaching Tip: Active Learning Using Debates in an IT Strategy Course",
                        "journal": "Journal of Information Systems Education",
                        "volume": "31",
                        "issue": "1",
                        "pages": "40-50",
                        "url": "https://jise.org/Volume31/n1/JISEv31n1p40.html",
                    },
                    "keywords": [
                        "Active learning",
                        "pedagogy",
                        "debate"
                    ],
                    "summary": "A study has shown that debates in an IT strategy course are beneficial for learning and enjoyment. Six weeks of preparation, research on audiences and specific assessment criteria were part of the debate format. The students' response has been positive and they see the relevance of working IT professionals. Debates, including technically focused ones like programming or database development, could be used in ISIT courses.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "R.",
                                "lastName": "Kennedy"
                            }
                        ],
                        "year": 2009,
                        "title": "The power of in-class debates",
                        "journal": "Active Learning in Higher Education",
                        "volume": "10",
                        "issue": "3",
                        "pages": "225–236",
                        "doi": "10.1177/1469787409343186",
                        "url": "https://doi.org/10.1177/1469787409343186",
                    },
                    "keywords": [
                        "Active learning",
                        "debate",
                        "critical thinking"
                    ],
                    "summary": "Debates stimulate active participation and content mastery, while fostering critical thinking skills. Knowledge and opinions are strongly influenced by the involvement of students in debates. Class debate becomes a very powerful tool of teaching, which can be used for different disciplines.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "O.",
                                "lastName": "Doody"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Condon"
                            }
                        ],
                        "year": 2012,
                        "title": "Increasing student involvement and learning through using debate as an assessment",
                        "journal": "Nurse Education in Practice",
                        "volume": "12",
                        "issue": "4",
                        "pages": "232–237",
                        "doi": "10.1016/j.nepr.2012.03.002",
                        "url": "https://doi.org/10.1016/j.nepr.2012.03.002",
                    },
                    "keywords": [
                        "Debate",
                        "reflection",
                        "critical thinking"
                    ],
                    "summary": "The importance of interaction between teachers and learners is important for education. Debates help to raise awareness of important issues, which in turn helps to stimulate divergent thinking. They call on students to actively engage in the learning process, promote diversity of perspective and take responsibility for their understanding. Debates help to facilitate discussions across large groups, increase personal knowledge and critical understanding.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S. K.",
                                "lastName": "Peasah"
                            },
                            {
                                "firstName": "L. L.",
                                "lastName": "Marshall"
                            }
                        ],
                        "year": 2017,
                        "title": "The use of debates as an active learning tool in a college of pharmacy healthcare delivery course",
                        "journal": "Currents in Pharmacy Teaching and Learning",
                        "volume": "9",
                        "issue": "3",
                        "pages": "433–440",
                        "doi": "10.1016/j.cptl.2017.01.012",
                        "url": "https://doi.org/10.1016/j.cptl.2017.01.012",
                    },
                    "keywords": [
                        "Debate",
                        "active learning"
                    ],
                    "summary": "The article follows up on debates in the pharmacy healthcare delivery course as well as an appraisal of student attitudes and perceptions. The findings show that debates are able to engage students on controversial health issues effectively. The teams presented evidence, addressed questions and concluded the debate. Surveys show that debates based on active learning strategies and prior research in the field of medical education are of great value for the achievement of the course content.",
                    "studentActivityScore": 9,
                    "lecturerActivityScore": 3
                }
            ]
        },
        {
            "name": "Discussion",
            "description": "Discussion based learning is an interactive approach to education that focuses on active student participation through group discussions and debates. This method requires students to express their views, share perspectives and take part in critical thinking instead of following lectures alone. The students learn how to listen, express their opinions and think about the diversity of views, thereby creating an active and constructive learning environment which is more than just lecture based methods.",
            "sub-category": "Discussion Board: Forum",
            "sources": [
                {
                    "citation": {
                        "type": "conference",
                        "authors": [
                            {
                                "firstName": "D.",
                                "lastName": "Nandi"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Hamilton"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Harland"
                            },
                            {
                                "firstName": "G.",
                                "lastName": "Warburton"
                            }
                        ],
                        "year": 2011,
                        "title": "How active are students in online discussion forums?",
                        "conference": "Proceedings of the Thirteenth Australasian Computing Education Conference - Volume 114 (ACE '11)",
                        "pages": "125–134",
                        "publisher": "Australian Computer Society, Inc.",
                    },
                    "keywords": [
                        "Online learning system",
                        "discussion forum"
                    ],
                    "summary": "The research focuses on the participation of online students in discussions, and its relation to grade levels. The findings show that there is a lack of engagement among the students. However, there was a correlation between high grades and consistent participation. This paper explores various factors impacting students' active online engagement.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 4
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M. G.",
                                "lastName": "Alzahrani"
                            }
                        ],
                        "year": 2017,
                        "title": "The effect of using online discussion forums on students’ learning",
                        "url": "https://eric.ed.gov/?id=EJ1124930",
                    },
                    "keywords": [
                        "Online discussion forums (ODFs)",
                        "achievement"
                    ],
                    "summary": "Communication and social skills are enhanced through online discussion forum (ODFs). Saudi students are fond of working together and value advice from their peers. There are mixed results in research on the link between participation of students in education funding schemes and learning outcomes, suggesting that situational factors may play a role. It appears that there is a relationship between traditional and ODF learning in terms of background knowledge. A higher grade point average has been obtained in experimental groups using ODFs, but some students have not completed their required tasks within these forums.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 4
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "F.",
                                "lastName": "Buckley"
                            }
                        ],
                        "year": 2011,
                        "title": "Online discussion forums",
                        "journal": "European Political Science",
                        "volume": "10",
                        "issue": "3",
                        "pages": "402–415",
                        "doi": "10.1057/eps.2010.76",
                        "url": "https://doi.org/10.1057/eps.2010.76",
                    },
                    "keywords": [
                        "Problem-based learning",
                        "discussion forums"
                    ],
                    "summary": "The study is designed to examine the usage of internet discussion forums by young political science students. The results show that students are more willing to use student-centred methods of teaching. The grading contributions to the Board Discussion Forums were supported by most students. However, low confidence, shyness, fear of mistakes and intimidation are among the reasons for not participating.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S. J.",
                                "lastName": "Blackmon"
                            }
                        ],
                        "year": 2012,
                        "title": "Outcomes of chat and discussion board use in online Learning: A research synthesis",
                        "url": "https://eric.ed.gov/?id=EJ985399",
                    },
                    "keywords": [
                        "Online learning",
                        "online teaching"
                    ],
                    "summary": "For the integration of students in full Internet courses, interactive discussions and chat rooms are essential. Teacher facilitations has to influence student participation. In online courses, it is possible to enhance results for students by examining effective online dialogue and chat methods.",
                    "studentActivityScore": 8,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "R. H.",
                                "lastName": "Trudeau"
                            }
                        ],
                        "year": 2005,
                        "title": "Get them to read, get them to talk: Using discussion forums to enhance student learning",
                        "journal": "Journal of Political Science Education",
                        "volume": "1",
                        "issue": "3",
                        "pages": "289–322",
                        "doi": "10.1080/15512160500261178",
                        "url": "https://doi.org/10.1080/15512160500261178",
                    },
                    "keywords": [
                        "Online discussion",
                        "forum"
                    ],
                    "summary": "The Discussion Forum promotes student involvement through CMS, which is a crucial component of the course grade. While it is optional, it is important for grades and students are able to take part in it throughout the semester. Overall, the question is beneficial for students, but a minority of them think that it limits their peers' learning. In spite of minor problems, it has good management and is rare in facing technical difficulties which positively impact on learning outcomes for students.",
                    "studentActivityScore": 5,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "A. A.",
                                "lastName": "Gasmi"
                            }
                        ],
                        "year": 2022,
                        "title": "Through the lens of students: How online discussion forums affect students’ learning",
                        "journal": "International Journal of Technology in Education (IJTE)",
                        "volume": "5",
                        "issue": "4",
                        "pages": "669-684",
                        "doi": "10.46328/ijte.291",
                        "url": "https://doi.org/10.46328/ijte.291",
                    },
                    "keywords": [
                        "Online discussion",
                        "engagement",
                        "critical thinking"
                    ],
                    "summary": "The study has examined the perspectives of 13 students on online discussion forums 'ODFs' in a virtual English language course at Sultan Qaboos University, Oman. ODFs were largely welcomed by participants, with improvements in critical skills, engagement and community interaction cited as reasons for this. The structured discussions were described as 'interesting', 'effective' and 'very useful'. The study focused on the effect of discussion structure on perception and student participation in high order thinking. Increased mental, emotional and cognitive engagement has also been observed.",
                    "studentActivityScore": 6,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S. S. M.",
                                "lastName": "Mohammed"
                            },
                            {
                                "firstName": "E. M.",
                                "lastName": "Onyema"
                            },
                            {
                                "firstName": "E. C. D.",
                                "lastName": "Deborah"
                            },
                            {
                                "firstName": "A. O.",
                                "lastName": "Alsayed"
                            },
                            {
                                "firstName": "Q. N. N.",
                                "lastName": "Mohammed"
                            }
                        ],
                        "year": 2019,
                        "title": "Online Discussion Forum as a tool for interactive learning and communication",
                        "journal": "International Journal of Recent Technology and Engineering",
                        "volume": "8",
                        "issue": "4",
                        "pages": "4852–4868",
                        "doi": "10.35940/ijrte.d8062.118419",
                        "url": "https://doi.org/10.35940/ijrte.d8062.118419",
                    },
                    "keywords": [
                        "Online discussion forum",
                        "interactive learning",
                        "e-learning",
                        "communication"
                    ],
                    "summary": "The technologies have a profound effect on student learning. Participation and learning are enhanced by online discussion forums, which can be used in conjunction with lectures. The computer helps to achieve objectives in education. These forums encourage constructive debate, support cooperation and transform the teacher's role into a facilitator. The right use of the digital learning system is key, even though student attitudes and their misuse can affect results.",
                    "studentActivityScore": 3,
                    "lecturerActivityScore": 9
                }
            ]
        },
        {
            "name": "Discussion",
            "description": "Discussion based learning is an interactive approach to education that focuses on active student participation through group discussions and debates. This method requires students to express their views, share perspectives and take part in critical thinking instead of following lectures alone. The students learn how to listen, express their opinions and think about the diversity of views, thereby creating an active and constructive learning environment which is more than just lecture based methods.",
            "sub-category": "Socratic Seminars",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Kinney"
                            }
                        ],
                        "year": 2022,
                        "title": "Revisiting the Socratic method of teaching to improve third-year pharmacy students' critical thinking and advanced pharmacy practice experience readiness in a critical care elective",
                        "journal": "Currents in Pharmacy Teaching and Learning",
                        "volume": "14",
                        "issue": "4",
                        "pages": "499–506",
                        "doi": "10.1016/j.cptl.2022.03.014",
                        "url": "https://doi.org/10.1016/j.cptl.2022.03.014",
                    },
                    "keywords": [
                        "Critical thinking",
                        "Socratic method"
                    ],
                    "summary": "The purpose of the study was to enhance pharmacy students' critical thinking, clinical reasoning and APPE training through a Socratic education method in an elective paediatrics course. The results show a significant increase in critical thinking, clinical reasoning and preparedness of students for APPE. In particular, they demonstrated significant improvements in the HSRT reasoning test score, increased positive APPE readiness survey results, and more favourable teaching style ratings than that of traditional courses. Overall, the Socratic method is highly effective in attracting students and providing significant improvements over a short period of time.",
                    "studentActivityScore": 5,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "thesis",
                        "authors": [
                            {
                                "firstName": "B. N.",
                                "lastName": "Roberson"
                            }
                        ],
                        "year": 2013,
                        "title": "Thesis on motivation towards learning perceived in Socratic seminar versus traditional lecture",
                        "source": "ProQuest database"
                    },
                    "keywords": [
                        "Socratic method",
                        "traditional lecture"
                    ],
                    "summary": "The study found that, contrary to the initial expectations, Socratic Seminars had a more positive influence on certain aspects of teaching than traditional lectures. This implies a need for an equitable approach to training that incorporates both methods. The wider point is that diversity of teaching strategies, demonstrating the importance of using various approaches to learning, has a different effect on student motivation and has to be chosen wisely.",
                    "studentActivityScore": 6,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "V. C.",
                                "lastName": "Polite"
                            },
                            {
                                "firstName": "A. H.",
                                "lastName": "Adams"
                            }
                        ],
                        "year": 1997,
                        "title": "Critical Thinking and Values Clarification through Socratic Seminars",
                        "journal": "Urban Education",
                        "volume": "32",
                        "issue": "2",
                        "pages": "256–278",
                        "doi": "10.1177/0042085997032002005",
                        "url": "https://doi.org/10.1177/0042085997032002005",
                    },
                    "keywords": [
                        "Critical thinking",
                        "Socratic method"
                    ],
                    "summary": "This article examines the effectiveness of Socratic seminars through qualitative research. The study took into consideration student involvement, focus groups and interviews with teachers and students. Results show that seminars support higher-order thinking, effective strategies for conflict resolution and increased interest in learning. Seminars on relevant and actual subjects have been highly praised, with those involving metaphoric learning situations considered less important.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 10
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Griswold"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "Shaw"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Munn"
                            }
                        ],
                        "year": 2017,
                        "title": "Socratic Seminar with Data: A Strategy to Support Student Discourse and Understanding",
                        "journal": "American Biology Teacher",
                        "volume": "79",
                        "issue": "6",
                        "pages": "492–495",
                        "doi": "10.1525/abt.2017.79.6.492",
                        "url": "https://doi.org/10.1525/abt.2017.79.6.492",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Analyzing and interpreting data",
                        "student-led discussion",
                        "socratic seminar"
                    ],
                    "summary": "The article explores how Socratic seminar can be adapted to engage students with data, leading to improved understanding and collaborative meaning-making. It focuses on a case study in a high school type 2 diabetes curriculum, where students analyzed complex data from the Diabetes Prevention Program study. The seminar format encouraged students to reason through the data together, fostering deeper comprehension and discussions about the implications of the findings. Teachers have found that the use of a Socratic seminar with data has helped to uncover student misunderstandings and has provided insight into their understanding of scientific concepts. The method has been used to promote student-led debates, thoughtful analysis and reflection on personal links in the subject. Teachers were able to improve the learning of students and their engagement with scientific data through specific questioning methods and debriefing sessions.",
                }
            ]
        },
        {
            "name": "Gamification",
            "description": "Gamification is a method of active student learning with game-like elements for creating a learning enviroment which aims at improving traditional education methods. It engages students in a more interactive way through the inclusion of features such as competition, prizes and challenges. This approach provides a different perspective on education, with lessons structured as a quests and evaluation as an achievement.  The method promotes participation, cooperation and monitoring of progress by means of immediate feedback.",
            "sub-category": "Gamification",
            "sources": []
        },
        {
            "name": "Gamification",
            "description": "Gamification is a method of active student learning with game-like elements for creating a learning enviroment which aims at improving traditional education methods. It engages students in a more interactive way through the inclusion of features such as competition, prizes and challenges. This approach provides a different perspective on education, with lessons structured as a quests and evaluation as an achievement.  The method promotes participation, cooperation and monitoring of progress by means of immediate feedback.",
            "sub-category": "Quests or Missions",
            "sources": []
        },
        {
            "name": "Gamification",
            "description": "Gamification is a method of active student learning with game-like elements for creating a learning enviroment which aims at improving traditional education methods. It engages students in a more interactive way through the inclusion of features such as competition, prizes and challenges. This approach provides a different perspective on education, with lessons structured as a quests and evaluation as an achievement.  The method promotes participation, cooperation and monitoring of progress by means of immediate feedback.",
            "sub-category": "Simulations",
            "sources": []
        },
        {
            "name": "Gamification",
            "description": "Gamification is a method of active student learning with game-like elements for creating a learning enviroment which aims at improving traditional education methods. It engages students in a more interactive way through the inclusion of features such as competition, prizes and challenges. This approach provides a different perspective on education, with lessons structured as a quests and evaluation as an achievement.  The method promotes participation, cooperation and monitoring of progress by means of immediate feedback.",
            "sub-category": "Interactive Storytelling",
            "sources": []
        },
        {
            "name": "Gamification",
            "description": "Gamification is a method of active student learning with game-like elements for creating a learning enviroment which aims at improving traditional education methods. It engages students in a more interactive way through the inclusion of features such as competition, prizes and challenges. This approach provides a different perspective on education, with lessons structured as a quests and evaluation as an achievement.  The method promotes participation, cooperation and monitoring of progress by means of immediate feedback.",
            "sub-category": "Badgets",
            "sources": []
        },
        {
            "name": "Gamification",
            "description": "Gamification is a method of active student learning with game-like elements for creating a learning enviroment which aims at improving traditional education methods. It engages students in a more interactive way through the inclusion of features such as competition, prizes and challenges. This approach provides a different perspective on education, with lessons structured as a quests and evaluation as an achievement.  The method promotes participation, cooperation and monitoring of progress by means of immediate feedback.",
            "sub-category": "Leaderboards and Points",
            "sources": []
        },
        {
            "name": "Flipped Classroom",
            "description": "The flipped classroom model redefines traditional learning by changing the typical structure. Before class, students independently review the teaching materials, often in the form of videos or readings, so that they can learn at their own pace. The classroom time is then devoted to collaborative activities, discussions and problem solving in the framework of a teacher's guidance. This approach increases active learning during face-to-face sessions and focuses on higher-order thinking skills. The model of flipping a classroom has to give students deeper understanding of the subject by emphasising interactive teaching.",
            "sub-category": "Flipped Classroom",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "I. T.",
                                "lastName": "Awidi"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Paynter"
                            }
                        ],
                        "year": 2023,
                        "title": "The impact of a flipped classroom approach on student learning experience",
                        "source": "Science Direct",
                        "retrievedFrom": "https://www.sciencedirect.com/science/article/pii/S0360131518302495"
                    },
                    "keywords": [
                        "Flipped classroom",
                        "participation and collaboration",
                        "assessment and feedback",
                        "engagement",
                        "motivation"
                    ],
                    "summary": "This article evaluates the impact of a specific flipped classroom approach on student learning experience. The study aims to assess satisfaction and observations from both students and the course coordinator (CC). It hypothesizes that students participating in the flipped approach would express high levels of satisfaction with elements of the approach and that this satisfaction would be linked to increased confidence, motivation, and engagement in learning. While primarily quantitative, the research also includes qualitative components.",
                    "studentActivityScore": 3,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Enfield"
                            }
                        ],
                        "year": 2023,
                        "title": "Looking at the Impact of the Flipped Classroom Model of Instruction on Undergraduate Multimedia Students at CSUN",
                        "source": "Springer",
                        "retrievedFrom": "https://link.springer.com/article/10.1007/s11528-013-0698-1"
                    },
                    "keywords": [
                        "Flipped classroom",
                        "technology integration",
                        "instructional videos"
                    ],
                    "summary": "This study examines the impact of the Flipped Classroom Model of Instruction on undergraduate multimedia students at California State University Northridge (CSUN). It explores how this approach equips students with resources for learning outside of class, thereby allowing for more engaging and interactive activities during class time. The study provides insights into the implementation and effectiveness of the flipped classroom approach in this specific educational context.",
                    "studentActivityScore": 6,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "Z.",
                                "lastName": "Unal"
                            },
                            {
                                "firstName": "A.",
                                "lastName": "Unal"
                            }
                        ],
                        "year": 2023,
                        "title": "Comparison of Student Performance, Student Perception, and Teacher Satisfaction with Traditional versus Flipped Classroom Models",
                        "retrievedFrom": "https://digitalcommons.georgiasouthern.edu/teach-elementary-facpubs/49/"
                    },
                    "keywords": [
                        "Flipped classroom",
                        "inverted teaching",
                        "online teaching",
                        "learning",
                        "student performance",
                        "student perception"
                    ],
                    "summary": "This study compares the effects of the traditional classroom model with the flipped classroom model on student performance, perceptions, and teacher satisfaction. It focuses on K-12 schools and finds that the flipped classroom approach, driven by technology, leads to better learning outcomes, higher student perceptions, and increased teacher satisfaction. The study suggests that technology-driven approaches have significant benefits for education, particularly at the K-12 level, and calls for further exploration of their advantages across different educational settings.",
                    "studentActivityScore": 5,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "C. J.",
                                "lastName": "Brame"
                            }
                        ],
                        "year": 2023,
                        "title": "Flipping the Classroom",
                        "retrievedFrom": "https://cft.vanderbilt.edu/guides-sub-pages/flipping-the-classroom/"
                    },
                    "keywords": [
                        "Flipped classroom"
                    ],
                    "summary": "Cynthia J. Brame's guide 'Flipping the Classroom' provides insights into teaching using the flipped classroom approach. It emphasizes pre-class preparation for students to grasp new material before class, allowing for deeper engagement during in-person sessions. The method has shown success across various disciplines, particularly in the humanities, and Brame's guide explores its potential benefits for other fields as well.",
                    "studentActivityScore": 4,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "F.",
                                "lastName": "Ozdamli"
                            }
                        ],
                        "year": 2016,
                        "title": "Flipped classroom approach",
                        "retrievedFrom": "https://eric.ed.gov/?id=EJ1141886"
                    },
                    "keywords": [
                        "Flipped learning",
                        "Flipped classroom",
                        "New approaches"
                    ],
                    "summary": "The text discusses the flipped classroom approach, where students receive instruction before class, allowing for interactive activities during class time. Teachers utilize video tools and systems to provide guidance, support, and establish learning conditions. While this approach offers benefits such as flexibility and deeper thinking, challenges may arise from inadequate preparation and unaddressed attendance issues.",
                    "studentActivityScore": 8,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "A. J.",
                                "lastName": "Boeve"
                            },
                            {
                                "firstName": "R. R.",
                                "lastName": "Meijer"
                            },
                            {
                                "firstName": "R. J.",
                                "lastName": "Bosker"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Vugteveen"
                            },
                            {
                                "firstName": "R.",
                                "lastName": "Hoekstra"
                            },
                            {
                                "firstName": "C. J.",
                                "lastName": "Albers"
                            }
                        ],
                        "year": 2023,
                        "title": "Implementing the flipped classroom: An exploration of study behavior and student performance",
                        "retrievedFrom": "https://link.springer.com/article/10.1007/s10734-016-0104-y"
                    },
                    "keywords": [
                        "Flipped classroom",
                        "Study behaviour",
                        "Student performance",
                        "Learning regulation",
                        "Course evaluations"
                    ],
                    "summary": "This study investigates study behavior, its impact on student performance, and student evaluations of their learning regulation ability in a flipped course. It acknowledges potential challenges in comparing student performance between flipped and regular courses due to various factors. The study reveals a significant relationship between practicing and student performance in the flipped course, highlighting the importance of self-regulation. Three themes emerged from the findings: students' desire for more regulation, preference for passive explanations, and recognition of the importance of self-regulation in benefiting from the flipped course lecture. The study emphasizes the need for ongoing research to further explore these areas and improve understanding of study behavior and its influence on learning outcomes.",
                    "studentActivityScore": 5,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "B.",
                                "lastName": "Danker"
                            }
                        ],
                        "year": 2023,
                        "title": "Using Flipped Classroom Approach to Explore Deep",
                        "retrievedFrom": "https://files.eric.ed.gov/fulltext/EJ1100618.pdf"
                    },
                    "keywords": [
                        "Flipped classroom",
                        "Curriculum design",
                        "Blended learning"
                    ],
                    "summary": "This project implemented two Flipped Classroom approaches in a film module as part of a Diploma in Performing Arts course at Sunway University, Malaysia. Online materials were used for reviewing and reinforcing lessons, while in-class time focused on problem-solving, advanced concepts, and collaborative learning. Survey results revealed that nearly half of the respondents attributed their high level of participation to engaging online lectures and in-class activities. The Flipped Classroom approach fostered active participation, valuable feedback, and encouraged students to take charge of their learning while fostering peer collaboration.",
                    "studentActivityScore": 3,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "C. L.",
                                "lastName": "Koo"
                            },
                            {
                                "firstName": "E. L.",
                                "lastName": "Demps"
                            },
                            {
                                "firstName": "C.",
                                "lastName": "Farris"
                            },
                            {
                                "firstName": "J. D.",
                                "lastName": "Bowman"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "Panahi"
                            },
                            {
                                "firstName": "P.",
                                "lastName": "Boyle"
                            }
                        ],
                        "year": 2023,
                        "title": "Impact of Flipped Classroom Design on Student Performance and Perceptions in a Pharmacotherapy Course",
                        "journal": "",
                        "volume": "",
                        "issue": "",
                        "pages": "",
                        "doi": "",
                        "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4827584/",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Flipped classroom",
                        "active learning",
                        "problem-based learning",
                        "pharmacotherapy"
                    ],
                    "summary": "This study compared a flipped classroom design with a traditional lecture course for second-year pharmacy students. The redesigned course included online components with videos and self-assessment questions. Students' postcourse survey scores significantly improved, and they appreciated applying video content during class time. Overall, students had a positive learning experience, as indicated by the survey and course evaluation.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "P.",
                                "lastName": "Strelan"
                            },
                            {
                                "firstName": "A.",
                                "lastName": "Osborn"
                            },
                            {
                                "firstName": "E.",
                                "lastName": "Palmer"
                            }
                        ],
                        "year": 2023,
                        "title": "[Title of the article]",
                        "journal": "Journal Name",
                        "volume": "Volume",
                        "issue": "Issue",
                        "pages": "page range",
                        "doi": "",
                        "url": "https://www.sciencedirect.com/science/article/pii/S1747938X19301599",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Flipped classroom",
                        "student performance"
                    ],
                    "summary": "This paper takes a look into how The flipped classroom approach has shaken up traditional teaching methods, presenting new challenges and opportunities. To create successful flipped classrooms, it's essential to have dedicated and self-assured teachers who are supported with sufficient time, resources, and guidance to develop an effective flipped model. In this article, they delve into an intriguing question: could the nature of student summative assessments influence the outcomes? Specifically, they explore how robust assessments may yield different results compared to less comprehensive ones, adding an interesting twist to the discussion.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "L.",
                                "lastName": "Abeysekera"
                            },
                            {
                                "firstName": "P.",
                                "lastName": "Dawson"
                            }
                        ],
                        "year": 2014,
                        "title": "Motivation and cognitive load in the flipped classroom: definition, rationale and a call for research",
                        "journal": "Higher Education Research and Development",
                        "volume": "34",
                        "issue": "1",
                        "pages": "1–14",
                        "doi": "10.1080/07294360.2014.934336",
                        "url": "https://doi.org/10.1080/07294360.2014.934336",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Flipped classroom",
                        "motivation",
                        "cognitive load",
                        "active learning"
                    ],
                    "summary": "This article looks at the theoretical basis of a flipped classroom approach, in particular as regards motivation and cognitive load. It discusses the big potential of the flipped classroom model to increase students' motivation by satisfying their needs for relatedness, autonomy and competence. The document also looks at how the flipped classroom can help manage the cognitive load through the provision of tailored learning experiences and opportunities for active participation.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "G.",
                                "lastName": "Akçayır"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Akçayır"
                            }
                        ],
                        "year": 2018,
                        "title": "The flipped classroom: A review of its advantages and challenges",
                        "journal": "Computers & Education",
                        "volume": "126",
                        "issue": "",
                        "pages": "334–345",
                        "doi": "10.1016/j.compedu.2018.07.021",
                        "url": "https://doi.org/10.1016/j.compedu.2018.07.021",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Teaching strategies",
                        "learning strategies",
                        "improving classroom teaching"
                    ],
                    "summary": "Authors systematically examined the advantages and challenges associated with the flipped classroom model in this article. To find out the reported advantages and disadvantages for students and teachers, a total of 71 research articles have been analysed. The benefits of a flipped classroom are improved student outcomes, increased interaction and time efficiency. The challenges, on the other hand, are course redesign, student motivation and technological competence.",
                    "studentActvityScore": 9,
                    "lecturerActivityScore": 8
                }  
            ]
        },
        {
            "name": "Flipped Classroom",
            "description": "The flipped classroom model redefines traditional learning by changing the typical structure. Before class, students independently review the teaching materials, often in the form of videos or readings, so that they can learn at their own pace. The classroom time is then devoted to collaborative activities, discussions and problem solving in the framework of a teacher's guidance. This approach increases active learning during face-to-face sessions and focuses on higher-order thinking skills. The model of flipping a classroom has to give students deeper understanding of the subject by emphasising interactive teaching.",
            "sub-category": "Peer Teaching",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "L.",
                                "lastName": "Rubin"
                            },
                            {
                                "firstName": "C.",
                                "lastName": "Hebert"
                            }
                        ],
                        "year": 1998,
                        "title": "Model for Active Learning: Collaborative Peer Teaching",
                        "journal": "College Teaching",
                        "volume": "46",
                        "issue": "1",
                        "pages": "26-30",
                        "doi": "",
                        "url": "https://www.jstor.org/stable/27558871",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Peer-teaching",
                        "student-centered methods",
                        "student performance",
                        "social awareness"
                    ],
                    "summary": "Active learning has emerged as a fundamental element of education and proven to be more successful than methods dominated by teachers. Peer teaching assignments have been successful, promoting active learning and benefiting both students and teachers, even though they were initially met with apprehension. By incorporating open-ended questions and the participation of students in assessments, this approach can be further refined to enhance intellectual and social growth.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "K. J.",
                                "lastName": "Graziano"
                            }
                        ],
                        "year": 2016,
                        "title": "Peer teaching in a flipped teacher education classroom",
                        "journal": "TechTrends",
                        "volume": "61",
                        "issue": "2",
                        "pages": "121–129",
                        "doi": "10.1007/s11528-016-0077-9",
                        "url": "",
                        "edition": "",
                        "publisher": ""
                    },
                    "keywords": [
                        "Flipped instruction",
                        "peer-teaching",
                        "interactive learning",
                        "technology skills",
                        "student engagement",
                        "collaborative learning"
                    ],
                    "summary": "The article examines the advantages and problems of implementing a modified learning style in teacher education classes. It examines the experiences of teaching in a flipped learning environment where students receive interactive learning, performance and preparation for the upcoming classroom. The study shows the positive aspects of student motivation through peer learning. This report also addresses challenges such as time-consuming multimedia creation and student accountability for the preparation activities. This method improves teachers' technological skills and supports a student cooperative learning approach.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "firstName": "V.",
                                "lastName": "Sukrajh"
                            }
                        ],
                        "year": 2018,
                        "title": "The use of peer teaching to promote active learning amongst senior medical students",
                        "url": "https://scholar.sun.ac.za/items/dbd913bc-ac9a-4feb-bdcf-2cb46bf168d3"
                    },
                    "keywords": [
                        "Peer-teaching",
                        "student performance"
                    ],
                    "summary": "Peer teaching was introduced at the Sefako Makgatho Health Sciences University to encourage active student participation. Deep learning, holistic understanding, and long-term retention have been found to be enhanced by fifth-year medical students preparing for teaching. Communication and emotion skills have been improved by teaching experience. On the other hand, students expressed mixed feelings as peer learners because of their concerns about wrong information and participation in lectures. The recommendations included the earlier introduction of peer learning and the involvement of senior peers in the teaching of young people. Alternative peer training and teaching techniques to healthcare professionals are highlighted in this study.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M. A.",
                                "lastName": "Muñoz"
                            },
                            {
                                "firstName": "G.",
                                "lastName": "Moreda"
                            },
                            {
                                "firstName": "N.",
                                "lastName": "Hernández-Sánchez"
                            },
                            {
                                "firstName": "V.",
                                "lastName": "Valiño"
                            }
                        ],
                        "year": 2012,
                        "title": "Student Reciprocal peer teaching as a method for Active Learning: an experience in an electrotechnical laboratory",
                        "journal": "Journal of Science Education and Technology",
                        "volume": "22",
                        "issue": "5",
                        "pages": "729–734",
                        "doi": "10.1007/s10956-012-9426-4",
                        "url": "https://doi.org/10.1007/s10956-012-9426-4"
                    },
                    "keywords": [
                        "Student experiments",
                        "active learning",
                        "peer-teaching"
                    ],
                    "summary": "The article explores an engineering course experiment involving laboratory sessions and reciprocal peer teaching among students from various specialties. In the theory or practical component of the examination, those who act as evaluators are more successful. The surveys have shown that laboratory sessions and monitoring methods are of use to students. The importance of practical training, which helps to strengthen theory and promote involvement in activities, is underlined.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 4
                } 
            ]
        },
        {
            "name": "Flipped Classroom",
            "description": "The flipped classroom model redefines traditional learning by changing the typical structure. Before class, students independently review the teaching materials, often in the form of videos or readings, so that they can learn at their own pace. The classroom time is then devoted to collaborative activities, discussions and problem solving in the framework of a teacher's guidance. This approach increases active learning during face-to-face sessions and focuses on higher-order thinking skills. The model of flipping a classroom has to give students deeper understanding of the subject by emphasising interactive teaching.",
            "sub-category": "Video Case",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Colasante"
                            },
                            {
                                "firstName": "K.",
                                "lastName": "Douglas"
                            }
                        ],
                        "year": 2016,
                        "title": "Video annotation ‘Prepare-Participate-Connect’ models: Promoting student learning",
                        "journal": "Australasian Journal of Educational Technology",
                        "doi": "10.14742/ajet.2123",
                        "url": "https://doi.org/10.14742/ajet.2123"
                    },
                    "keywords": [
                        "Video annotation",
                        "tertiary education"
                    ],
                    "summary": "Learning satisfaction and results have been affected by factors such as video suitability, analysis type, activity depth or timing of intervention. Rogow's process of tertiary education has been adapted by the insights from this study. The project investigated the role of MAT in various sectors and areas, conducting surveys, interviews as well as observations. The study found educational benefits, but a potential depth of challenges in education has been identified.  Recommendations suggest that student oversight, collaboration and control of participation in video annotation practices should be encouraged.",
                    "studentActvityScore": 4,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "firstName": "C.",
                                "lastName": "Vondrick"
                            }
                        ],
                        "year": 2011,
                        "title": "Video Annotation and Tracking with Active Learning",
                        "url": "https://proceedings.neurips.cc/paper_files/paper/2011/hash/182be0c5cdcd5072bb1864cdee4d3d6e-Abstract.html"
                    },
                    "keywords": [
                        "Video annotation",
                        "active learning"
                    ],
                    "summary": "In order to address the issue of labelling an enormous amount of video information, this article introduces a new dynamic learning framework for visual annotation and tracking. The proposal is to apply an adaptive keyframes strategy that compels workers to tag special objects on frames with a view to optimising performance.",
                    "studentActvityScore": 4,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Hoel"
                            },
                            {
                                "firstName": "A. N.",
                                "lastName": "Jakobsen"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "Mehli"
                            }
                        ],
                        "year": 2020,
                        "title": "Video cases to bring the working life perspective into the classroom",
                        "journal": "Uniped",
                        "volume": "43",
                        "issue": "4",
                        "pages": "312-330",
                        "publisher": "Universitetsforlaget",
                        "doi": "10.18261/issn.1893-8981-2020-04-04",
                        "url": ""
                    },
                    "keywords": [
                        "Video case",
                        "motivation"
                    ],
                    "summary": "This study examines how using filmed cases from the food industry can make food microbiology more relevant to students and enhance their learning. The flipped classroom approach received positive feedback, with students appreciating the flexibility of filmed lectures. The cases were seen as relevant to real-world work, leading to better preparation among students. Moreover, case-based teaching improved students' generic skills, resulting in enhanced academic performance compared to previous years.",
                    "studentActvityScore": 5,
                    "lecturerActivityScore": 2
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "K.",
                                "lastName": "Seo"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Dodson"
                            },
                            {
                                "firstName": "N. M.",
                                "lastName": "Harandi"
                            },
                            {
                                "firstName": "N. D.",
                                "lastName": "Roberson"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Fels"
                            },
                            {
                                "firstName": "I.",
                                "lastName": "Roll"
                            }
                        ],
                        "year": 2021,
                        "title": "Active learning with online video: The impact of learning context on engagement",
                        "journal": "Computers & Education",
                        "volume": "165",
                        "pages": "104132",
                        "doi": "10.1016/j.compedu.2021.104132",
                        "url": "https://doi.org/10.1016/j.compedu.2021.104132"
                    },
                    "keywords": [
                        "Video-based learning",
                        "engagement"
                    ],
                    "summary": "The article looks at how students interact with video on the internet across different educational contexts. It discusses the use of hyper video players in the classroom and the need for further research to understand how students' activities are influenced by their objectives. In this study ViDeX hyper video player was used to create instructional videos and the effect of educational context on student engagement goals has been examined. Based on the results, recommendations have also been drawn up for educational design.",
                    "studentActvityScore": 5,
                    "lecturerActivityScore": 7
                }   
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Experimental Learning",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J. E.",
                                "lastName": "Huerta-Wong"
                            },
                            {
                                "firstName": "R.",
                                "lastName": "Schoech"
                            }
                        ],
                        "year": 2010,
                        "title": "Experiential Learning and Learning Environments: The Case of Active Listening Skills",
                        "journal": "Journal of Social Work Education",
                        "volume": "46",
                        "issue": "1",
                        "pages": "85–101",
                        "url": "http://www.jstor.org/stable/23044702"
                    },
                    "keywords": [
                        "Learning environments",
                        "active listening skills",
                        "teaching techniques",
                        "satisfaction",
                        "perception of learning gains",
                        "randomized procedure"
                    ],
                    "summary": "The article compares the effectiveness of virtual and face-to-face learning with different teaching methods and discusses the use of active listening principles in virtual learning environments. It has shown that satisfaction, perception of learning improvement, and educational attainment are strongly influenced by the teaching methods and education environment. However, the absence of a randomized selection procedure for placing students in different groups is one of the main drawbacks of this study.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 4
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "C.",
                                "lastName": "Chiang"
                            },
                            {
                                "firstName": "P.",
                                "lastName": "Wells"
                            },
                            {
                                "firstName": "G.",
                                "lastName": "Xu"
                            }
                        ],
                        "year": 2021,
                        "title": "How does experiential learning encourage active learning in auditing education?",
                        "journal": "Journal of Accounting Education",
                        "volume": "54",
                        "pages": "100713",
                        "url": "https://doi.org/10.1016/j.jaccedu.2020.100713"
                    },
                    "keywords": [
                        "Mini-audit",
                        "audit education",
                        "active learning",
                        "teamwork"
                    ],
                    "summary": "The article discusses the use of mini-audit evaluations as a form of experiential learning in audit training. The report highlights the positive response of students to practical learning experiences and emphasis on teamwork. The evaluation required that all four stages of the experiential learning cycle were completed, involving decision making and practical use of audit concepts.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "book chapter",
                        "authors": [
                            {
                                "firstName": "J. W.",
                                "lastName": "Gentry"
                            }
                        ],
                        "year": 1990,
                        "title": "Chapter 2. In Guide to Business Gaming and Experiential Learning",
                        "pages": "9-20",
                        "publisher": "Nichols/GP Pub",
                        "url": "https://wmich.edu/sites/default/files/attachments/u5/2013/WHAT%20IS%20EXPERIENTIAL%20%20LEARNING%3F%20%20.pdf"
                    },
                    "keywords": [
                        "Experiential learning",
                        "practical experiences",
                        "feedback",
                        "learning outcomes"
                    ],
                    "summary": "The article addresses the concept of Experiential Learning, which is a type of education that takes place through real experiences instead of classroom teachings. The importance of hands-on activities, real world interaction and feedback during the learning process is emphasised. Different methods of experiential learning, such as internships, research projects and live case teaching, allow students to apply theoretical knowledge in practice. It stresses the role of trainers to guide and monitor experiential learning experiences to ensure effective achievement of educational outcomes. Overall, the article underscores the significance of experiential learning in enhancing cognitive, emotional, and behavioural dimensions of learning.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 7
                }
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Art Integrated Learning",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "S.",
                                "lastName": "Gowri"
                            },
                            {
                                "firstName": "P.",
                                "lastName": "Thote"
                            }
                        ],
                        "year": 2020,
                        "title": "Experiential learning: Tool for joyful learning",
                        "journal": "International Journal of Research - GRANTHAALAYAH",
                        "volume": "8",
                        "issue": "5",
                        "pages": "100–107",
                        "url": "https://doi.org/10.29121/granthaalayah.v8.i5.2020.88"
                    },
                    "keywords": [
                        "Art integrated learning",
                        "mathematics",
                        "creativity",
                        "evaluation"
                    ],
                    "summary": "This research examines the impact of Art Integrated Learning on the academic achievement of grade 5 students in mathematics. The results find that Art Integrated Learning improved the academic achievement of students in the experiential group. This teaching method has been well-established and proven effective for all grades, genders, and socio-economic backgrounds in various studies. It creates engaging and joyful classroom environments, enhancing both teachers and students' thinking through reciprocal engagement in lessons.",
                    "studentActivityScore": 6,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "K.",
                                "lastName": "DeMoss"
                            },
                            {
                                "firstName": "T.",
                                "lastName": "Morris"
                            }
                        ],
                        "year": 2002,
                        "title": "How Arts Integration Supports Student learning Students shed Light on the connections",
                        "publisher": "Chicago Arts Partnerships in Education (CAPE)",
                        "location": "Chicago, IL",
                        "url": "https://www.scirp.org/reference/referencespapers?referenceid=1857021"
                    },
                    "keywords": [
                        "Learning environment",
                        "cognitive processes"
                    ],
                    "summary": "The study conducted in Chicago Public Schools examined the impact of arts integration on learning. The presence of veteran artists partnering with teachers positively influenced the atmosphere. Arts-integrated units demonstrated high achievement and deep knowledge in subjects, providing more meaningful connections to academic work. Students in these units showed more positive associations with the subject matter, leading to deeper analytical and conceptual understanding. Data collection involved interviews, observations, and writing samples. Issues identified included changes in division of labor and student participation. Additionally, schools with veteran arts partnerships had higher income averages compared to CPS schools in general.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 9
                }
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "DLS, MCEL",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "A.",
                                "lastName": "Bhati"
                            },
                            {
                                "firstName": "I.",
                                "lastName": "Song"
                            }
                        ],
                        "year": 2019,
                        "title": "New Methods for Collaborative Experiential Learning to Provide Personalised Formative Assessment",
                        "journal": "International Journal of Emerging Technologies in Learning (iJET)",
                        "volume": "14",
                        "issue": "07",
                        "pages": "179–195",
                        "url": "https://doi.org/10.3991/ijet.v14i07.9173"
                    },
                    "keywords": [
                        "Mobile learning",
                        "collaborative learning",
                        "experiential learning",
                        "dynamic learning space",
                        "formative assessment"
                    ],
                    "summary": "The study introduces a method combining dynamic learning spaces (DLS) and mobile collaborative experiential learning (MCEL) to improve teaching and learning. This approach offers personalized formative feedback at reduced cost and promotes high-level learning while catering to diverse learning styles. Mobile devices facilitate collaborative experiential learning environments, enabling access to simulated labs for continuous feedback and increased engagement. Participants perceived the approach as beneficial and expressed satisfaction with personalized learning experiences.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 9
                }
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Formative Feedback, PBL, prBL",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "A.",
                                "lastName": "Webb"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Moallem"
                            }
                        ],
                        "year": 2016,
                        "title": "Feedback and Feed-Forward for Promoting Problem-Based Learning in Online Learning Environments",
                        "journal": "Malaysian Journal of Learning and Instruction",
                        "volume": "13",
                        "issue": "2",
                        "pages": "1–41",
                        "url": "https://doi.org/10.32890/mjli2016.13.2.1"
                    },
                    "keywords": [
                        "Problem-based learning",
                        "project-based learning",
                        "feedback and feed-forward",
                        "online learning"
                    ],
                    "summary": "The study aimed to design and test a feedback model for online graduate-level Problem-Based Learning (PBL). Feedback delivery methods, including through Blackboard, were well received by students. The study emphasized setting feed-forward goals and using metacognitive questioning for better student achievement. It highlighted the vital role of students' own behavior in seeking timely feedback to succeed in PBL.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 7
                }
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Immersive Virtual Reality Role",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "E. A.",
                                "lastName": "Alrehaili"
                            },
                            {
                                "firstName": "A. H.",
                                "lastName": "Osman"
                            }
                        ],
                        "year": 2022,
                        "title": "A virtual reality role-playing serious game for experiential learning",
                        "journal": "Interactive Learning Environments",
                        "volume": "30",
                        "issue": "5",
                        "pages": "922-935",
                        "url": "https://doi.org/10.1080/10494820.2019.1703008"
                    },
                    "keywords": [
                        "Virtual Reality",
                        "immersive",
                        "HMD",
                        "role-playing",
                        "serious games",
                        "learning effectiveness"
                    ],
                    "summary": "The study introduces an immersive Virtual Reality Role-Playing Game (VRRPG) for training honeybee behavior, comparing its effectiveness to a Digital Book and two Virtual Reality versions. After a week, the DVR honeybee group retained more information than the book. No significant difference was found between the two VR versions, both of which provided an engaging role-playing experience. In summary, VR Immersive RPGs offer promising alternatives to traditional teaching methods.",
                    "studentActivityScore": 4,
                    "lecturerActivityScore": 6
                }
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Inquiry-based Learning",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "B. Y.",
                                "lastName": "White"
                            },
                            {
                                "firstName": "J. R.",
                                "lastName": "Frederiksen"
                            }
                        ],
                        "year": 1998,
                        "title": "Inquiry, Modeling, and Metacognition: Making Science Accessible to All Students",
                        "journal": "Cognition and Instruction",
                        "volume": "16",
                        "issue": "1",
                        "pages": "3–118",
                        "url": "http://www.jstor.org/stable/3233668"
                    },
                    "keywords": ["Online learning", "curriculum"],
                    "summary": "The study investigates the impact of the ThinkerTools inquiry curriculum on science education for students at different learning levels. It demonstrates that the curriculum improves students' ability to understand and investigate physics, particularly benefiting those with lower academic performance. Notably, students at lower grade levels show exceptional progress in problem-solving compared to even high school physics students. This approach has the potential to engage and support a wider range of students in science education, thereby boosting interest and success in this area.",
                    "studentActivityScore": 6,
                    "lecturerActivityScore": 7
                }
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Special Diet Experience",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "L.",
                                "lastName": "Ball"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Leveritt"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Desbrow"
                            }
                        ],
                        "year": 2013,
                        "title": "Students’ Perceptions of an Experiential Learning Activity Designed to Develop Knowledge of Food and Food Preparation Methods",
                        "journal": "Journal of Food Science Education",
                        "volume": "12",
                        "issue": "3",
                        "pages": "56-60",
                        "url": "https://doi.org/10.1111/1541-4329.12009"
                    },
                    "keywords": ["Diets", "challenge"],
                    "summary": "The study explores university students' perceptions of a food-focused experiential learning task designed to enhance knowledge of food and food preparation methods. By introducing students to new food experiences followed by guided reflection, the activity aimed to deviate from typical learning methods. Results indicated improvements in food-related skills and increased empathy among students, contributing to an overall positive learning experience. However, some students perceived the challenge as burdensome, despite acknowledging the positive outcomes. The study suggests that students' perceptions of the value of such activities were not consistently influenced by the pleasure experienced.",
                    "studentActivityScore": 5,
                    "lecturerActivityScore": 7
                }                
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Role-play (RP); SPs, TIE",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "P.",
                                "lastName": "Isotalus"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Koponen"
                            },
                            {
                                "firstName": "E.",
                                "lastName": "Pyörälä"
                            }
                        ],
                        "year": 2012,
                        "title": "Comparing three experiential learning methods and their effect on medical students attitudes to learning communication skills",
                        "journal": "Medical Teacher",
                        "volume": "34",
                        "issue": "3",
                        "pages": "e198-e207",
                        "doi": "10.3109/0142159X.2011.613492"
                    },
                    "keywords": ["Communication skills learning", "simulations"],
                    "summary": "This study assessed the attitudes of Finnish second-year medical students towards learning communication skills before and after a 3-month pilot course utilizing experiential learning methods like TIE, SPs, and RP. The findings indicated a significant increase in positive attitudes and a decrease in negative attitudes by the end of the course. Integrating experiential learning methods with communication skills training and health center visits effectively emphasized the importance of communication skills early in students' medical studies. The study suggests that a communication course based on experiential learning methods can positively impact students' attitudes within a reasonable timeframe. However, the study acknowledges its limitations and calls for further research to assess the long-term sustainability and effectiveness of these methods.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 7
                }                
            ]
        },
        {
            "name": "Experimental Learning",
            "description": "Experiential learning is an innovative method of teaching in which students are immersed in hands on activities, practical programs and reflections. The difference from the usual teaching methods. is encouraging a dynamic learning environment where students are active participants in their education journey. Experiential learning is not only deepening the understanding but also developing critical thinking and problem solving skills through collaboration projects and simulations. This method helps students to deal with real world challenges by bridging the gap between theory and practice.",
            "sub-category": "Simulated Training",
            "sources": [
                {
                    "citation": {
                        "authors": [
                            {
                                "firstName": "A.",
                                "lastName": "Svellingen"
                            }
                        ],
                        "year": 2022,
                        "title": "Simulation-based education: Effect of repetitive simulation in nursing education",
                        "type": "Doctoral dissertation",
                        "number": "36",
                        "institution": "VID Specialized University",
                        "location": "Oslo, Norway"
                    },
                    "keywords": ["Simulation", "engagement"],
                    "summary": "This doctoral dissertation examines the impact of repetitive simulation training on nursing students' competence and learning outcomes. Drawing on Norwegian and international research, simulation is recognized as a valuable pedagogical method in nursing education. The study findings indicate that repetitive simulation, either in preparation for or during clinical placements, enhances student learning by reducing anxiety, fear, and stress. This reduction in negative emotions fosters an environment of psychological safety, allowing students to focus on learning and preparation. The study suggests that repetitive simulation can complement or even replace other pedagogical methods, enabling students to practice, reflect, and develop self-awareness of their competence within the practice community.",
                    "studentActivityScore": 7,
                    "lecturerActivityScore": 5
                }                
            ]
        },
        {
            "name": "Game-based Learning",
            "description": "Game based learning provides educational content through games, simulations and interactive activities that integrate the interactivity of gaming into education. This approach is attracting students' attention and providing an Immersive Learning Experience, through its integration of challenges, rewards or progression. Learning through games not only entertains, but also strengthens active problem solving, critical thinking, and decision making skills. The instant feedback in the games allows students to learn from their mistakes and keep track of progress, which provides a dynamic and interactive way for learning and applying knowledge within an educational context.",
            "sub-category": "Gamification",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M. I.",
                                "lastName": "Cicchino"
                            }
                        ],
                        "year": 2015,
                        "title": "Using Game-Based Learning to Foster Critical Thinking in Student Discourse",
                        "journal": "Interdisciplinary Journal of Problem-based Learning",
                        "volume": "9",
                        "issue": "2",
                        "pages": "",
                        "doi": "https://doi.org/10.7771/1541-5015.1481",
                    },
                    "keywords": [
                        "Game-based learning",
                        "GBL",
                        "critical thinking",
                        "games",
                        "educational game",
                        "problem-based learning"
                    ],
                    "summary": "The study examines the impact of a Game-Based Learning (GBL) intervention on critical thinking and content knowledge retention in 8th-grade Social Studies. The GBL intervention involved students playing a game simulating the French and Indian War, encouraging problem-solving and critical thinking. The results showed no significant difference in content knowledge between GBL and traditional instruction groups. However, the GBL intervention promoted student engagement, small-group discourse, and reflective processes. Integration, the highest level of critical thinking, occurred in only 4.2% of measured units. The study suggests deliberate spaces for reflection to enhance sustained critical thinking. The results support constructivist-style learning environments, aligned with current teacher-evaluation models. Future research should explore heightened and sustained critical thinking in innovative problem-solving contexts. The limitations include non-random group selection and the brevity of the content knowledge test. Overall, GBL shows promise in fostering critical thinking and student-centred learning. The study calls for further investigation and refinement of GBL principles.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Hartt"
                            },
                            {
                                "firstName": "H.",
                                "lastName": "Hosseini"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Mostafapour"
                            }
                        ],
                        "year": 2020,
                        "title": "Game On: Exploring the Effectiveness of Game-based Learning",
                        "journal": "Planning Practice and Research",
                        "volume": "35",
                        "issue": "5",
                        "pages": "589–604",
                        "doi": "https://doi.org/10.1080/02697459.2020.1778859",
                    },
                    "keywords": [
                        "Gamification",
                        "game-based learning",
                        "active learning",
                        "board game",
                        "card game"
                    ],
                    "summary": "The study explored the effectiveness of game-based learning in planning education. Two lectures, one traditional and one gamified, were conducted to assess students' perceptions of learning, engagement, and teamwork. The gamified lecture involved a board game simulating demographic processes related to population forecasts. Results showed that students preferred the gamified lecture, finding it more engaging and memorable. However, game-based learning might be better suited for certain aspects of planning education and requires thoughtful integration. Overall, game-based learning offers exciting opportunities for enhancing higher education pedagogy.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 5
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Tay"
                            },
                            {
                                "firstName": "Y.",
                                "lastName": "Goh"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Safiena"
                            },
                            {
                                "firstName": "H.",
                                "lastName": "Bound"
                            }
                        ],
                        "year": 2022,
                        "title": "Designing digital game-based learning for professional upskilling: A systematic literature review",
                        "journal": "Computers & Education",
                        "volume": "184",
                        "pages": "104518",
                        "doi": "https://doi.org/10.1016/j.compedu.2022.104518",
                        "url": "https://doi.org/10.1016/j.compedu.2022.104518",
                    },
                    "keywords": [
                        "Digital game-based learning",
                        "digital game",
                        "professional development"
                    ],
                    "summary": "DGBL has shown promising learning outcomes, including improved academic performance and increased retention of knowledge. However, mixed results have been observed in some studies, highlighting the need to consider factors like game design and teaching strategies. The role of teachers in the development and implementation of DGBL is crucial, with their involvement in game development aligning gameplay with instructional objectives and setting the tone for effective learning experiences. To maximise the effectiveness of DGBL, researchers and educators are encouraged to carefully select gamification elements, align them with pedagogical frameworks, and provide teachers with training in DGBL. As technology continues to advance, DGBL is expected to play an increasingly significant role in education and professional upskilling programs.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "book chapter",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Gosper"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "McNeill"
                            }
                        ],
                        "year": 2012,
                        "title": "Implementing Game-Based Learning: The MAPLET Framework as a guide to Learner-Centred design and assessment",
                        "bookTitle": "Springer eBooks",
                        "pages": "217–233",
                        "doi": "https://doi.org/10.1007/978-1-4614-3546-4_12",
                        "publisher": "Springer"
                    },
                    "keywords": [
                        "Assessment strategy",
                        "assessment task",
                        "metacognitive skill",
                        "summative assessment",
                        "gaming activity"
                    ],
                    "summary": "The article explores how game-based learning has the ability to support a variety of learning objectives and skills, including fundamental knowledge, metacognitive skills, and creative abilities. The MAPLET framework is introduced as a method for game-based learning alignment of learning objectives, learner characteristics, and assessment strategies. The concept is built on three stages of intellectual skill development: early stages emphasise fundamental knowledge and abilities, middle stages involve problem-solving, and late stages target automated execution and knowledge transfer. In order to complement particular learning objectives, each phase recommends appropriate game activities, such as simulations and puzzles. When employing games as learning tools, the article underlines the significance of having a clear aim. It also stresses the necessity for more research and empirical case studies to improve and put the framework into use.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "firstName": "Z.",
                                "lastName": "Liu"
                            }
                        ],
                        "year": 2020,
                        "title": "Using the concept of Game-Based Learning in education",
                        "url": "https://www.semanticscholar.org/paper/Using-the-Concept-of-Game-Based-Learning-in-Liu-Shaikh/3bd80addc3873f1c6cb195f40712f5a39da3fea8/"
                    },
                    "keywords": [
                        "E-learning",
                        "game-based learning",
                        "gamification"
                    ],
                    "summary": "Game-based learning (GBL) is a promising approach to address modern education challenges. With the rise of the 'native digital' generation, lifelong learning and 21st-century skills like creativity and problem-solving are essential. GBL, using video games and game elements in education, has shown positive effects on student motivation and learning outcomes. However, challenges include creating high-quality games and providing proper teacher training. A study confirmed that GBL increases student motivation, involvement, and effective learning outcomes compared to traditional methods. Further research on its long-term effects is needed. Overall, GBL holds great potential for enhancing modern education.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Pivec"
                            }
                        ],
                        "year": 2007,
                        "title": "Editorial: Play and learn: potentials of game-based learning",
                        "journal": "British Journal of Educational Technology",
                        "volume": "38",
                        "issue": "3",
                        "pages": "387–393",
                        "doi": "10.1111/j.1467-8535.2007.00722.x",
                        "url": "https://doi.org/10.1111/j.1467-8535.2007.00722.x"
                    },
                    "keywords": [
                        "Critical skills",
                        "teacher role",
                        "digital learning",
                        "digital teaching"
                    ],
                    "summary": "The text highlights how GBL has evolved from being perceived as an unserious activity to a method with great potential for promoting 21st-century skills. Studies have shown that well-designed educational games can effectively engage students and develop critical skills. However, there remain challenges, such as selecting appropriate games and providing teacher training. Despite these obstacles, the growing interest in GBL and its positive impact on learning outcomes provide reasons to be optimistic about its potential for transforming education in the future.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "K.",
                                "lastName": "Kiili"
                            }
                        ],
                        "year": 2005,
                        "title": "Digital game-based learning: Towards an experiential gaming model",
                        "journal": "Internet and Higher Education",
                        "volume": "8",
                        "issue": "1",
                        "pages": "13–24",
                        "doi": "10.1016/j.iheduc.2004.12.001",
                        "url": "https://doi.org/10.1016/j.iheduc.2004.12.001"
                    },
                    "keywords": [
                        "Educational game",
                        "flow",
                        "experiential learning",
                        "game design"
                    ],
                    "summary": "The text explores the multifaceted world of designing web-based learning materials with a primary focus on student engagement. It highlights the limitations of using the web solely as an information distribution channel, urging for the creation of interactive learning experiences. To tackle this, the paper introduces the concept of integrating educational theories with game design, emphasizing the potential of educational games to capture students' attention and motivation. The experiential gaming model presented in the text serves as a blueprint for designing meaningful and engaging educational games. By matching challenges to individual skill levels and providing immediate feedback, the model strives to create a state of flow, where learners are fully absorbed and immersed in the learning process. Furthermore, the text delves into the role of storytelling, game balance, and cognitive load optimization in educational game design, ultimately striving to strike the right balance between entertainment and educational objectives. Overall, this approach seeks to empower learners to actively explore, reflect, and construct knowledge, leading to improved learning outcomes and a positive educational experience.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Qian"
                            },
                            {
                                "firstName": "K.",
                                "lastName": "Clark"
                            }
                        ],
                        "year": 2016,
                        "title": "Game-based Learning and 21st century skills: A review of recent research",
                        "journal": "Computers in Human Behavior",
                        "volume": "63",
                        "pages": "50–58",
                        "doi": "10.1016/j.chb.2016.05.023",
                        "url": "https://doi.org/10.1016/j.chb.2016.05.023"
                    },
                    "keywords": [
                        "Game-based learning",
                        "learning theory",
                        "game design"
                    ],
                    "summary": "This literature review examines the impact of game-based learning (GBL) on 21st-century skills development. Analyzing 137 papers, it highlights the importance of game design and learning theories. Design-based games showed greater effectiveness than traditional educational or entertainment games. Critical thinking skills were the most frequently studied outcome, while communication and creativity received less attention. Collaboration, competition, complexity, exploration, and role-playing were identified as key game design elements. Reporting effect sizes was found crucial for practical implications. Overall, GBL shows promise in enhancing 21st-century skills through effective game design and learning theories.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M. M.",
                                "lastName": "Ariffin"
                            },
                            {
                                "firstName": "A.",
                                "lastName": "Oxley"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Sulaiman"
                            }
                        ],
                        "year": 2014,
                        "title": "Evaluating game-based learning effectiveness in higher education",
                        "journal": "Procedia - Social and Behavioral Sciences",
                        "volume": "123",
                        "pages": "20–27",
                        "doi": "10.1016/j.sbspro.2014.01.1393",
                        "url": "https://doi.org/10.1016/j.sbspro.2014.01.1393"
                    },
                    "keywords": [
                        "Game-based learning(GBL)",
                        "learner's background"
                    ],
                    "summary": "The text explores Game-Based Learning (GBL) as an alternative educational tool and evaluates its effectiveness in higher education. It focuses on the correlations between learners' cultural elements, ethnicity, native language, motivation, and performance. The research findings indicate a strong positive relationship between learners' background factors and their motivation to learn and perform better. Integrating cultural elements, ethnicity, and native language into the GBL environment can enhance learners' engagement and outcomes. This highlights the significance of considering learners' diverse backgrounds in designing effective educational games. Overall, the study emphasises the importance of incorporating cultural context in GBL to create more engaging and successful learning experiences.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 10
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "N.",
                                "lastName": "Bado"
                            }
                        ],
                        "year": 2019,
                        "title": "Game-based learning pedagogy: a review of the literature",
                        "journal": "Interactive Learning Environments",
                        "volume": "30",
                        "issue": "5",
                        "pages": "936–948",
                        "doi": "10.1080/10494820.2019.1683587",
                        "url": "https://doi.org/10.1080/10494820.2019.1683587"
                    },
                    "keywords": [
                        "Digital game",
                        "pedagogy",
                        "education",
                        "learning"
                    ],
                    "summary": "The article investigates the pedagogical dimension of game-based learning (GBL) and highlights the crucial role of teachers in effectively integrating digital games into the educational process. It addresses the lack of attention given to pedagogy in GBL literature reviews and highlights the significance of understanding teachers' instructional practices during pre-game, game, and post-game stages. The study reveals that teachers implement diverse instructional activities, such as gameplay training, content scaffolding, classroom management, and technical support, to facilitate students' engagement and learning outcomes. However, the post-game debriefing stage is often overlooked in GBL, which warrants greater attention. Overall, the article advocates for a holistic approach to GBL pedagogy, highlighting the importance of teacher involvement in maximising the educational benefits of digital games.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 10
                },
                {
                    "citation": {
                        "type": "book",
                        "authors": [
                            {
                                "firstName": "G.",
                                "lastName": "Molin"
                            }
                        ],
                        "year": 2017,
                        "title": "The Role of the Teacher in Game-Based Learning: A Review and outlook",
                        "pages": "649–674",
                        "publisher": "Springer eBooks",
                        "doi": "10.1007/978-3-319-51645-5_28",
                        "url": "https://doi.org/10.1007/978-3-319-51645-5_28"
                    },
                    "keywords": [
                        "Game-based teaching",
                        "game-based learning",
                        "teacher agency",
                        "Goffman frame analysis",
                        "game design",
                        "digital game",
                        "teacher role"
                    ],
                    "summary": "The article explores the vital role of teachers in game-based learning and the challenges they face when incorporating digital games into their teaching. It emphasises the necessity of giving teachers agency in this situation. The empirical studies highlight the challenges teachers face, such as inadequate training and challenges connecting game content to curriculum goals. According to the proposed participatory design model, teachers should design their own games for their classrooms and develop game-based lessons that are tailored to the needs of their students. In order to protect teachers' professional identities, discussions about teacher agency and the effects of new educational reforms are emphasised.",
                    "studentActvityScore": 10,
                    "lecturerActivityScore": 10
                }
            ]
        },
        {
            "name": "Game-based Learning",
            "description": "Game based learning provides educational content through games, simulations and interactive activities that integrate the interactivity of gaming into education. This approach is attracting students' attention and providing an Immersive Learning Experience, through its integration of challenges, rewards or progression. Learning through games not only entertains, but also strengthens active problem solving, critical thinking, and decision making skills. The instant feedback in the games allows students to learn from their mistakes and keep track of progress, which provides a dynamic and interactive way for learning and applying knowledge within an educational context.",
            "sub-category": "Digital Platform",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "D. a. D. N. D.",
                                "lastName": "Santos"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "De Oliveira Sousa"
                            },
                            {
                                "firstName": "A. E.",
                                "lastName": "Guelfi"
                            },
                            {
                                "firstName": "D.",
                                "lastName": "De Souza Machado"
                            },
                            {
                                "firstName": "L. H. D. E. S.",
                                "lastName": "Santana"
                            }
                        ],
                        "year": 2022,
                        "title": "Be Active: design and creation of an innovative digital platform for active methodologies",
                        "journal": "Research, Society and Development",
                        "volume": "11",
                        "issue": "9",
                        "pages": "e49111932236",
                        "doi": "10.33448/rsd-v11i9.32236",
                        "url": "https://doi.org/10.33448/rsd-v11i9.32236"
                    },
                    "keywords": [
                        "Active Methodologies",
                        "Digital Platform",
                        "Innovation"
                    ],
                    "summary": "The article gives background on the development of a digital platform, Be Active, which is specifically designed to use active learning methodologies. It's based on problem-based learning and gamification strategies that offer features like team formations, chat rooms or performance tables. To map and increase student learning and engagement, the platform's methodology includes six phases: problem registration, formation of a team, solution generation, assessment by students.",
                    "studentActvityScore": 5,
                    "lecturerActivityScore": 7
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Montebello"
                            }
                        ],
                        "year": 2020,
                        "title": "A ‘Digital Pedagogies’–Based Learning Platform",
                        "journal": "Education and New Developments 2020",
                        "doi": "10.36315/2020end037",
                        "url": "https://doi.org/10.36315/2020end037"
                    },
                    "keywords": [
                        "Digital pedagogies",
                        "e-learning",
                        "virtual learning environment",
                        "ubiquitous learning",
                        "learning analytics"
                    ],
                    "summary": "The document highlights the shift from knowledge transfer to knowledge management and building, as well as the development of digital pedagogies and eLearning. The objective is to emphasise the usefulness of eLearning over traditional methods, in particular by highlighting an online writing and evaluation environment called 'Scholar' as an example of new learning opportunities that can be exploited. It recommends that educational portals should be designed with a focus on learning needs and predict improvements in student interaction and attitudes toward eLearning.",
                    "studentActvityScore": 5,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "name": "Japan Science and Technology Agency"
                            }
                        ],
                        "year": 2017,
                        "title": "Hiroaki Ogata - M2B System: A Digital Learning Platform for Traditional Classrooms in University",
                        "url": "https://researchmap.jp/read0184047/published_papers/18391158?lang=en"
                    },
                    "keywords": [
                        "Traditional classroom",
                        "learning logs",
                        "learning analysis",
                        "real-time processing",
                        "e-book",
                        "Moodle",
                        "Mahara"
                    ],
                    "summary": "The article addresses the M2B system, a digital learning platform designed to be used for traditional classroom teaching in universities. Three subsystems are contained in this system: the Moodle, Mahara and eBook systems. It collects learning logs for learning analytics and provides tools for supporting teaching and learning in classes on site.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 8
                }
            ]
        },
        {
            "name": "Game-based Learning",
            "description": "Game based learning provides educational content through games, simulations and interactive activities that integrate the interactivity of gaming into education. This approach is attracting students' attention and providing an Immersive Learning Experience, through its integration of challenges, rewards or progression. Learning through games not only entertains, but also strengthens active problem solving, critical thinking, and decision making skills. The instant feedback in the games allows students to learn from their mistakes and keep track of progress, which provides a dynamic and interactive way for learning and applying knowledge within an educational context.",
            "sub-category": "Educational Game",
            "sources": [
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Papastergiou"
                            }
                        ],
                        "year": 2009,
                        "title": "Digital Game-Based Learning in high school Computer Science education: Impact on educational effectiveness and student motivation",
                        "journal": "Computers & Education",
                        "volume": "52",
                        "issue": "1",
                        "pages": "1–12",
                        "doi": "10.1016/j.compedu.2008.06.004",
                        "url": "https://doi.org/10.1016/j.compedu.2008.06.004"
                    },
                    "keywords": [
                        "Digital game-based learning",
                        "early childhood education",
                        "video game",
                        "situated learning",
                        "critical pedagogy"
                    ],
                    "summary": "Computer games have become an integral part of our social and cultural environment, and are particularly appealing to children and adolescents, for whom they constitute the most popular computer activity in the home. Prior research on domestic computer use has shown that games are more popular with boys, who are more frequent, intensive and experienced game players than girls, and more likely to participate in players’ communities for the exchange of game-related resources.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 6
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "D.",
                                "lastName": "López-Fernández"
                            },
                            {
                                "firstName": "A.",
                                "lastName": "Gordillo"
                            },
                            {
                                "firstName": "P. P.",
                                "lastName": "Alarcón"
                            },
                            {
                                "firstName": "E.",
                                "lastName": "Tovar"
                            }
                        ],
                        "year": 2021,
                        "title": "Comparing Traditional teaching and Game-Based Learning using Teacher-Authored Games on Computer Science education",
                        "journal": "IEEE Transactions on Education",
                        "volume": "64",
                        "issue": "4",
                        "pages": "367–373",
                        "doi": "10.1109/te.2021.3057849",
                        "url": "https://doi.org/10.1109/te.2021.3057849"
                    },
                    "keywords": [
                        "Active learning",
                        "computer science",
                        "computer-based instruction",
                        "educational technology",
                        "games"
                    ],
                    "summary": "The article discusses the impact of motivation on university students' academic performance, particularly in computer science degrees with high dropout rates. It explores the potential of game-based learning (GBL) to increase student motivation through educational video games designed for learning. The study compares traditional teaching methods with GBL using teacher-authored games in computer science courses and finds that GBL significantly boosts student motivation without compromising learning effectiveness. The research highlights the importance of using GBL judiciously to maintain its motivational impact.",
                    "studentActvityScore": 4,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "M.",
                                "lastName": "Li"
                            },
                            {
                                "firstName": "C.",
                                "lastName": "Tsai"
                            }
                        ],
                        "year": 2013,
                        "title": "Game-Based Learning in Science Education: A review of Relevant research",
                        "journal": "Journal of Science Education and Technology",
                        "volume": "22",
                        "issue": "6",
                        "pages": "877–898",
                        "doi": "10.1007/s10956-013-9436-x",
                        "url": "https://doi.org/10.1007/s10956-013-9436-x"
                    },
                    "keywords": [
                        "Science education",
                        "science learning",
                        "game-based learning",
                        "digital game",
                        "educational game"
                    ],
                    "summary": "By promoting cooperation in solving problems and creating interactive learning environments, digital games offer an opportunity to enhance science education. Game-based learning is rooted in a variety of theories, including cognitivism, constructivism, sociocultural perspectives and enactivism, that focus on outcomes such as scientific knowledge, problem solving skills, engagement, emotional impact. Learning outcomes are significantly influenced by the effective design and implementation of games and by the promotion of collaboration through clear objectives, rules and feedback systems.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "firstName": "KDE Group, University of Kassel and DMIR Group, University of Würzburg and L3S Research Center, Hannover (Germany)"
                            }
                        ],
                        "year": 2003,
                        "title": "Aspects of Game- based Learning | BIBSonomy",
                        "url": "https://www.bibsonomy.org/bibtex/c6b0cf1e2dcd4b7193cfba34f8de3463"
                    },
                    "keywords": [
                        "Educational video game",
                        "game elements",
                        "game design"
                    ],
                    "summary": "The article emphasises the need for innovative learning methods that align with modern generations' preferences. It proposes game-based learning, using educational video games to engage learners and enhance the learning process. Game-based learning blurs instructional content with game elements, providing motivating and immersive experiences. It fosters active knowledge construction, collaboration, and problem-solving skills. The article showcases successful examples and highlights the importance of aligning game design with pedagogical approaches for effective learning outcomes.",
                    "studentActvityScore": 3,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "journal",
                        "authors": [
                            {
                                "firstName": "L. H.",
                                "lastName": "Von Wobeser"
                            },
                            {
                                "firstName": "V.",
                                "lastName": "Hernández"
                            },
                            {
                                "firstName": "F.",
                                "lastName": "Neyra"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Carrillo"
                            }
                        ],
                        "year": 2022,
                        "title": "The use of Massive Online Games in game-based learning activities",
                        "journal": "Revista Innova Educación",
                        "volume": "4",
                        "issue": "3",
                        "pages": "7–30",
                        "doi": "10.35622/j.rie.2022.03.001",
                        "url": "https://doi.org/10.35622/j.rie.2022.03.001"
                    },
                    "keywords": [
                        "Learning",
                        "videogames",
                        "virtual reality",
                        "virtual world"
                    ],
                    "summary": "The article discusses the potential use of Roblox, a popular online gaming platform that can be used for learning purposes. It stresses the immersive and entertaining nature of Massive Multiplayer Games such as Roblox, which can be used to introduce students to an entirely new kind of learning experience. The study examined how students reacted to the use of Roblox for learning activities, which covered topics like dinosaurs and disease. The impact of social interaction and the development of skills for students was also highlighted. The study offers practical guidance for teachers on the effective integration of Roblox in teaching environments, emphasising the need to address possible risks and use user interface features as a learning tool.",
                    "studentActvityScore": 4,
                    "lecturerActivityScore": 9
                }
            ]
        },
        {
            "name": "Game-based Learning",
            "description": "Game based learning provides educational content through games, simulations and interactive activities that integrate the interactivity of gaming into education. This approach is attracting students' attention and providing an Immersive Learning Experience, through its integration of challenges, rewards or progression. Learning through games not only entertains, but also strengthens active problem solving, critical thinking, and decision making skills. The instant feedback in the games allows students to learn from their mistakes and keep track of progress, which provides a dynamic and interactive way for learning and applying knowledge within an educational context.",
            "sub-category": "Educational Game; serious game",
            "sources": [
                {
                    "citation": {
                        "type": "conference paper",
                        "authors": [
                            {
                                "firstName": "A.",
                                "lastName": "Franceschini"
                            },
                            {
                                "firstName": "A.",
                                "lastName": "Rodà"
                            }
                        ],
                        "year": 2023,
                        "title": "Play to Learn: from Serious Games to just Games",
                        "conference": "Proceedings of the 2023 ACM Conference on Information Technology for Social Good (GoodIT '23)",
                        "pages": "117–127",
                        "publisher": "Association for Computing Machinery",
                        "doi": "10.1145/3582515.3609525",
                        "url": "https://doi.org/10.1145/3582515.3609525"
                    },
                    "keywords": [
                        "Digital game",
                        "video game",
                        "educational game",
                        "serious game",
                        "entertainment"
                    ],
                    "summary": "The paper discusses the use of digital games as an education tool in which both games intended for learning purposes and those that have been reutilized are used. It notes that educational games developers face publishing differences between academic and entertainment developed games, as well as the challenges they face in developing them. Special games, such as Pentiment and Lausanne 1830, are mentioned at a crossroads between entertainment and education.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "firstName": "K.",
                                "lastName": "Bakhsh"
                            }
                        ],
                        "year": 2022,
                        "title": "Effectiveness of digital game based learning strategy in higher educational perspectives",
                        "url": "https://eric.ed.gov/?id=EJ1372872"
                    },
                    "keywords": [
                        "Digital game based learning",
                        "effectiveness",
                        "engagement",
                        "higher education"
                    ],
                    "summary": "The article underlines the positive impact of game based learning in higher education, highlighting its effectiveness as a way to engage students and improve their outcomes. It looks at the possibilities of creating an active learning experience through digital games, enabling students to be involved in their educational process. The study also addresses the importance of providing instant feedback to students, promoting collaboration through multiplayer features, and fostering a growth mindset among learners. In addition, the research highlights the need for teachers to adapt to new systems and tools in a multicultural environment, as well as exploring the role of ICT in education.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 9
                }
            ]
        },
        {
            "name": "Game-based Learning",
            "description": "Game based learning provides educational content through games, simulations and interactive activities that integrate the interactivity of gaming into education. This approach is attracting students' attention and providing an Immersive Learning Experience, through its integration of challenges, rewards or progression. Learning through games not only entertains, but also strengthens active problem solving, critical thinking, and decision making skills. The instant feedback in the games allows students to learn from their mistakes and keep track of progress, which provides a dynamic and interactive way for learning and applying knowledge within an educational context.",
            "sub-category": "Serious Game",
            "sources": [
                {
                    "citation": {
                        "type": "journal",
                        "authors": [
                            {
                                "firstName": "T. E.",
                                "lastName": "Coleman"
                            },
                            {
                                "firstName": "A. G.",
                                "lastName": "Money"
                            }
                        ],
                        "year": 2019,
                        "title": "Student-centred digital game–based learning: a conceptual framework and survey of the state of the art",
                        "journal": "Higher Education",
                        "volume": "79",
                        "issue": "3",
                        "pages": "415–457",
                        "doi": "10.1007/s10734-019-00417-0",
                        "url": "https://doi.org/10.1007/s10734-019-00417-0"
                    },
                    "keywords": [
                        "Student-centred learning",
                        "digital game–based learning",
                        "serious game",
                        "game design",
                        "video game"
                    ],
                    "summary": "This study presents a conceptual framework of student-centred digital game-based learning (SCDGBL) derived from literature published between 2007 and 2018. The framework categorises SCDGBL interventions into single player, mixed, and multiplayer engagements, based on player involvement. Key findings reveal a strong focus on certain student-centred learning elements like active learning and autonomy, but a lack of attention to 'social' elements like mutual respect and cooperative learning. The study explores Gee's principles of good game design and suggests integrating them early in game design to enhance learning outcomes. It emphasises the need to align game design with existing research on how students learn to fully utilise the potential of digital game-based learning. Future studies should explore all student-centred learning elements and use design principles to create effective educational games.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "journal",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Hamari"
                            },
                            {
                                "firstName": "D. J.",
                                "lastName": "Shernoff"
                            },
                            {
                                "firstName": "E.",
                                "lastName": "Rowe"
                            },
                            {
                                "firstName": "B. D.",
                                "lastName": "Coller"
                            },
                            {
                                "firstName": "J.",
                                "lastName": "Asbell-Clarke"
                            },
                            {
                                "firstName": "T.",
                                "lastName": "Edwards"
                            }
                        ],
                        "year": 2016,
                        "title": "Challenging games help students learn: An empirical study on engagement, flow and immersion in game-based learning",
                        "journal": "Computers in Human Behavior",
                        "volume": "54",
                        "pages": "170–179",
                        "doi": "10.1016/j.chb.2015.07.045",
                        "url": "https://doi.org/10.1016/j.chb.2015.07.045"
                    },
                    "keywords": [
                        "Game-based learning",
                        "gamification",
                        "serious games",
                        "flow",
                        "engagement",
                        "immersion"
                    ],
                    "summary": "The study highlights the potential of educational video games to effectively engage students and promote learning. Designers are encouraged to emphasise challenge and engagement while considering players' skill levels, thereby keeping learners within their Zone of Proximal Development (ZPD) and motivated to learn. Additionally, the findings suggest that game-based learning offers individualized customization, making it a learner-centered approach that challenges the traditional one-size-fits-all mentality in education.",
                    "studentActvityScore": 2,
                    "lecturerActivityScore": 8
                },
                {
                    "citation": {
                        "type": "web",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Cieutat"
                            }
                        ],
                        "year": 2012,
                        "title": "Active Learning based on the use of Augmented Reality Outline of Possible Applications: Serious Games, Scientific Experiments, Confronting Studies with Creation, Training for Carrying out Technical Skills",
                        "url": "https://hal.science/hal-00739730/"
                    },
                    "keywords": [
                        "Active learning",
                        "augmented reality",
                        "serious game",
                        "training simulators"
                    ],
                    "summary": "The paper looks at how augmented reality can help active learning in a variety of areas, such as serious gaming, scientific experiments, linking the results of studies with the creation and training of technical skills. The authors present a new definition of Augmented Reality and cite original examples such as the AR Serious game for understanding electromagnetic phenomena and the AR Based Welding Training App.  It emphasizes serious games in AR systems for active learning, particularly in understanding electromagnetic concepts and their application in electrical engineering.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "P.",
                                "lastName": "Lameras"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Arnab"
                            },
                            {
                                "firstName": "I.",
                                "lastName": "Dunwell"
                            },
                            {
                                "firstName": "C.",
                                "lastName": "Stewart"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Clarke"
                            },
                            {
                                "firstName": "P.",
                                "lastName": "Petridis"
                            }
                        ],
                        "year": 2016,
                        "title": "Essential features of serious games design in higher education: Linking learning attributes to game mechanics",
                        "journal": "British Journal of Educational Technology",
                        "volume": "48",
                        "issue": "4",
                        "pages": "972–994",
                        "doi": "10.1111/bjet.12467",
                        "url": "https://doi.org/10.1111/bjet.12467"
                    },
                    "keywords": [
                        "Serious game",
                        "games design",
                        "engagement",
                        "motivation",
                        "teacher roles",
                        "game mechanics"
                    ],
                    "summary": "This review is intended to investigate the link between learning design and gaming mechanics in Serious Games SGs. It envisages the development of a research programme aiming at ascertaining the alignment among suggested and applied theories in SG use by means of quantitative methods. The study focuses on the key role played by teachers to guide game based learning in a cognitive domain.  It identifies 165 relevant papers and examines specific learning activities related to game elements and feedback, laying the foundations for informed learning in games.",
                    "studentActvityScore": 10,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "C.",
                                "lastName": "Kazimoglu"
                            },
                            {
                                "firstName": "M.",
                                "lastName": "Kiernan"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "Bacon"
                            },
                            {
                                "firstName": "L.",
                                "lastName": "MacKinnon"
                            }
                        ],
                        "year": 2012,
                        "title": "A serious game for developing computational thinking and learning introductory computer programming",
                        "journal": "Procedia - Social and Behavioral Sciences",
                        "volume": "47",
                        "pages": "1991–1999",
                        "doi": "10.1016/j.sbspro.2012.06.938",
                        "url": "https://doi.org/10.1016/j.sbspro.2012.06.938"
                    },
                    "keywords": [
                        "Serious game",
                        "game-based learning",
                        "computational thinking",
                        "programming"
                    ],
                    "summary": "In the context of teaching Computer Science theory and application, academicians use game-based learning. Research focuses on a game framework for Computational Thinking (CT) skills. A serious game designed for introductory programming and CT received positive student feedback for its enjoyable nature and potential to enhance problem-solving. There are a few lacks in existing programming training games for the development of CT skills. The CT and programming structures are integrated into the 'Program your robot' game.  The game had been helpful for students' understanding of programming and strengthening their problem solving skills.",
                    "studentActvityScore": 7,
                    "lecturerActivityScore": 9
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "J.",
                                "lastName": "Kaczmarczyk"
                            },
                            {
                                "firstName": "R.",
                                "lastName": "Davidson"
                            },
                            {
                                "firstName": "D.",
                                "lastName": "Bryden"
                            },
                            {
                                "firstName": "S.",
                                "lastName": "Haselden"
                            },
                            {
                                "firstName": "P.",
                                "lastName": "Vivekananda-Schmidt"
                            }
                        ],
                        "year": 2015,
                        "title": "Learning decision making through serious games",
                        "journal": "The Clinical Teacher",
                        "volume": "13",
                        "issue": "4",
                        "pages": "277–282",
                        "doi": "10.1111/tct.12426",
                        "url": "https://doi.org/10.1111/tct.12426"
                    },
                    "keywords": [
                        "Serious game",
                        "engagement",
                        "motivation"
                    ],
                    "summary": "In order to teach medical students how to make clinical decisions, this study has created a Serious Game (SG). According to findings from 47 validated questionnaires and 31 focus group participants, serious games attract, motivate, help in decision-making, repetition of knowledge, which can be a useful tool for evaluating medical education.",
                    "studentActvityScore": 8,
                    "lecturerActivityScore": 10
                },
                {
                    "citation": {
                        "type": "article",
                        "authors": [
                            {
                                "firstName": "T.",
                                "lastName": "Anastasiadis"
                            },
                            {
                                "firstName": "Γ.",
                                "lastName": "Λαμπρόπουλος"
                            },
                            {
                                "firstName": "K. V.",
                                "lastName": "Siakas"
                            }
                        ],
                        "year": 2018,
                        "title": "Digital game-based learning and serious games in education",
                        "journal": "International Journal of Advances in Scientific Research and Engineering",
                        "volume": "4",
                        "issue": "12",
                        "pages": "139–144",
                        "doi": "10.31695/ijasre.2018.33016",
                        "url": "https://doi.org/10.31695/ijasre.2018.33016"
                    },
                    "keywords": [
                        "Game-based learning",
                        "serious game",
                        "educational games",
                        "interactive learning environments",
                        "collaborative learning"
                    ],
                    "summary": "The article looks at the importance of using serious games, in particular digital game learning methods for enhancing students' educational experience. This emphasises the importance of motivation and engagement in improving students' educational performance and social skills. Serious games can help students develop critical thinking, decision making, and problem solving skills through interactive and engaging learning environments. The article also highlights the benefits of serious games in fostering collaboration, communication and a favourable competitive environment for young people.",
                    "studentActvityScore": 6,
                    "lecturerActivityScore": 10
                }
            ]
        }
    ]
}